#pragma once

/**
 * Name: DBD
 * Version: 601
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * UserDefinedStruct ASet_Slasher_27_LookAT.ASet_Slasher_27_LookAT
	 * Size -> 0x0040
	 */
	struct FASet_Slasher_27_LookAT
	{
	public:
		class UAimOffsetBlendSpace*                                Aim_Offset_FPV_41_5E605F9E4C315DAB36C9D29490A62259;      // 0x0000(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UAimOffsetBlendSpace*                                Aim_Offset_Interaction_FPV_45_A0C4E5884B7C70C6A9BE6A9BB7579F2B; // 0x0008(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UAimOffsetBlendSpace*                                Aim_Offset_42_88BAC9BA42ECC8D77E5F618709DA4411;          // 0x0010(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UAnimSequence*                                       TurnLeft_38_6274ADC24F31B2E9AED426BEE48B7928;            // 0x0018(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UAnimSequence*                                       TurnRight_39_49F1324742D9AC22C4585EA45215B52B;           // 0x0020(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UAimOffsetBlendSpace*                                Carry_Aim_Offset_54_804C678346A7D741BE812BA391B809ED;    // 0x0028(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UAnimSequence*                                       CarryTurnLeft_50_EA67CC0C4FFB48912FAED68BFE703642;       // 0x0030(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UAnimSequence*                                       CarryTurnRight_51_1AC9E7BC4504FAAF331080AAAAF9011F;      // 0x0038(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
