#pragma once

/**
 * Name: DBD
 * Version: 601
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function BP_Lobby_StartScreen_Lite.BP_Lobby_StartScreen_Lite_C.BndEvt__BP_Lobby_StartScreen_Lite_P_Lobby_StartScreen_Lite_K2Node_ComponentBoundEvent_0_ParticleSpawnSignature__DelegateSignature
	 */
	struct ABP_Lobby_StartScreen_Lite_C_BndEvt__BP_Lobby_StartScreen_Lite_P_Lobby_StartScreen_Lite_K2Node_ComponentBoundEvent_0_ParticleSpawnSignature__DelegateSignature_Params
	{
	public:
		class FName                                                EventName;                                               // 0x0000(0x000C)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		float                                                      EmitterTime;                                             // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		struct FVector                                             Location;                                                // 0x0000(0x000C)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		struct FVector                                             Velocity;                                                // 0x0000(0x000C)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function BP_Lobby_StartScreen_Lite.BP_Lobby_StartScreen_Lite_C.ExecuteUbergraph_BP_Lobby_StartScreen_Lite
	 */
	struct ABP_Lobby_StartScreen_Lite_C_ExecuteUbergraph_BP_Lobby_StartScreen_Lite_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
