#pragma once

/**
 * Name: DBD
 * Version: 601
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Classes
	// --------------------------------------------------
	/**
	 * Class DBDBots.AIDisplayDebugInterface
	 * Size -> 0x0000 (FullSize[0x0030] - InheritedSize[0x0030])
	 */
	class UAIDisplayDebugInterface : public UInterface
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AIGoalGeneratorInterface
	 * Size -> 0x0000 (FullSize[0x0030] - InheritedSize[0x0030])
	 */
	class UAIGoalGeneratorInterface : public UInterface
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AIIntentionValidatorInterface
	 * Size -> 0x0000 (FullSize[0x0030] - InheritedSize[0x0030])
	 */
	class UAIIntentionValidatorInterface : public UInterface
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AIPathValidatorInterface
	 * Size -> 0x0000 (FullSize[0x0030] - InheritedSize[0x0030])
	 */
	class UAIPathValidatorInterface : public UInterface
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill
	 * Size -> 0x0090 (FullSize[0x00C0] - InheritedSize[0x0030])
	 */
	class UAISkill : public UObject
	{
	public:
		struct FGameplayTagContainer                               RunContexts;                                             // 0x0030(0x0020) Edit, DisableEditOnInstance, NativeAccessSpecifierPublic
		bool                                                       StopIfPausedByNavLinkProxy;                              // 0x0050(0x0001) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_E0V6[0x3];                                   // 0x0051(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      RunTimeLimit;                                            // 0x0054(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      RunCooldownTime;                                         // 0x0058(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      RunCooldownTimeDeviation;                                // 0x005C(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UClass*                                              SkillNavigationFilterClass;                              // 0x0060(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic
		TArray<class UAISenseConfig*>                              SkillSenseConfigs;                                       // 0x0068(0x0010) Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPublic
		class UBehaviorTree*                                       DynamicSubtree;                                          // 0x0078(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_BJ34[0x18];                                  // 0x0080(0x0018) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<class UObject*>                                     _pausedByObjects;                                        // 0x0098(0x0010) ZeroConstructor, Transient, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_D71L[0x10];                                  // 0x00A8(0x0010) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class ADBDAIBTController*                                  _aiControllerOwner;                                      // 0x00B8(0x0008) ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_Diversion
	 * Size -> 0x0050 (FullSize[0x0110] - InheritedSize[0x00C0])
	 */
	class UAISkill_Diversion : public UAISkill
	{
	public:
		class FName                                                perkId;                                                  // 0x00C0(0x000C) Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_QWO9[0x4];                                   // 0x00CC(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<class UClass*>                                      DiversionFromGoalClasses;                                // 0x00D0(0x0010) Edit, ZeroConstructor, DisableEditOnTemplate, UObjectWrapper, NativeAccessSpecifierPublic
		EAIDifficultyLevel                                         ThrowOnInteractablesAtDifficultyLevel;                   // 0x00E0(0x0001) Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_4V4L[0x3];                                   // 0x00E1(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      MaxThrowOnInteractableHalfAngle;                         // 0x00E4(0x0004) Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      MaxMoveToTargetDistance;                                 // 0x00E8(0x0004) Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FVector                                             NavMeshFindLocationExtents;                              // 0x00EC(0x000C) Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      PlanInterval;                                            // 0x00F8(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_OUIN[0x14];                                  // 0x00FC(0x0014) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_Find
	 * Size -> 0x0040 (FullSize[0x0100] - InheritedSize[0x00C0])
	 */
	class UAISkill_Find : public UAISkill
	{
	public:
		class UClass*                                              FindClass;                                               // 0x00C0(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FGameplayTag                                        BlackboardWishListTag;                                   // 0x00C8(0x000C) Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      SearchInterval;                                          // 0x00D4(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       MustBeSeen;                                              // 0x00D8(0x0001) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_QQHV[0x7];                                   // 0x00D9(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<class UObject*>                                     _currentWishedObjects;                                   // 0x00E0(0x0010) ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_8768[0x10];                                  // 0x00F0(0x0010) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_FindInteractable
	 * Size -> 0x0018 (FullSize[0x0118] - InheritedSize[0x0100])
	 */
	class UAISkill_FindInteractable : public UAISkill_Find
	{
	public:
		class FString                                              RequiredInteractionId;                                   // 0x0100(0x0010) Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EInputInteractionType                                      RequiredInteractionInputType;                            // 0x0110(0x0001) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_K3JN[0x7];                                   // 0x0111(0x0007) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_FindCollectable
	 * Size -> 0x0008 (FullSize[0x0120] - InheritedSize[0x0118])
	 */
	class UAISkill_FindCollectable : public UAISkill_FindInteractable
	{
	public:
		int32_t                                                    CollectUnderItemCount;                                   // 0x0118(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      CollectOverItemChargeRatio;                              // 0x011C(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_FindCollectable_Camper
	 * Size -> 0x0000 (FullSize[0x0120] - InheritedSize[0x0120])
	 */
	class UAISkill_FindCollectable_Camper : public UAISkill_FindCollectable
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_FindCollectable_Hatchet
	 * Size -> 0x0000 (FullSize[0x0120] - InheritedSize[0x0120])
	 */
	class UAISkill_FindCollectable_Hatchet : public UAISkill_FindCollectable
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_FindCollectable_Searchable
	 * Size -> 0x0018 (FullSize[0x0138] - InheritedSize[0x0120])
	 */
	class UAISkill_FindCollectable_Searchable : public UAISkill_FindCollectable
	{
	public:
		float                                                      SearchIntervalAfterOpenSearchable;                       // 0x0120(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      OpenSearchableRelevancyDuration;                         // 0x0124(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_CO0W[0x8];                                   // 0x0128(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class ASearchable*                                         _relevantSearchable;                                     // 0x0130(0x0008) ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_FindCollectable_Trap
	 * Size -> 0x0000 (FullSize[0x0120] - InheritedSize[0x0120])
	 */
	class UAISkill_FindCollectable_Trap : public UAISkill_FindCollectable
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_FindInteractable_CloseTelevisionNearGenerator
	 * Size -> 0x0060 (FullSize[0x0178] - InheritedSize[0x0118])
	 */
	class UAISkill_FindInteractable_CloseTelevisionNearGenerator : public UAISkill_FindInteractable
	{
	public:
		struct FAITunableParameter                                 MaximumCondemnedPercentToCloseTelevision;                // 0x0118(0x0010) Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic
		struct FAITunableParameter                                 DistanceBetweenGeneratorAndTelevisionThreshold;          // 0x0128(0x0010) Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic
		struct FAITunableParameter                                 BaseValue;                                               // 0x0138(0x0010) Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic
		struct FAITunableParameter                                 CloseTelevisionDistanceLinearWeight;                     // 0x0148(0x0010) Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic
		struct FAITunableParameter                                 CloseTelevisionMaximumDistanceFromCamper;                // 0x0158(0x0010) Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic
		struct FAITunableParameter                                 MaxHeightDifferenceToCloseTelevisions;                   // 0x0168(0x0010) Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_FindInteractable_SolveCondemned
	 * Size -> 0x0040 (FullSize[0x0158] - InheritedSize[0x0118])
	 */
	class UAISkill_FindInteractable_SolveCondemned : public UAISkill_FindInteractable
	{
	public:
		struct FAITunableParameter                                 NearCondemnedWeight;                                     // 0x0118(0x0010) Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic
		struct FAITunableParameter                                 HighCondemnedThreshold;                                  // 0x0128(0x0010) Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic
		struct FAITunableParameter                                 SolveCondemnedBasicWeight;                               // 0x0138(0x0010) Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic
		struct FAITunableParameter                                 CondemnedLevelProportionalWeight;                        // 0x0148(0x0010) Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_FindInteractable_SolveRBT
	 * Size -> 0x0020 (FullSize[0x0138] - InheritedSize[0x0118])
	 */
	class UAISkill_FindInteractable_SolveRBT : public UAISkill_FindInteractable
	{
	public:
		struct FAITunableParameter                                 UrgencyGoalWeight;                                       // 0x0118(0x0010) Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic
		struct FAITunableParameter                                 PriorityGoalWeight;                                      // 0x0128(0x0010) Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_FindInteractable_SolveSickness
	 * Size -> 0x0010 (FullSize[0x0128] - InheritedSize[0x0118])
	 */
	class UAISkill_FindInteractable_SolveSickness : public UAISkill_FindInteractable
	{
	public:
		struct FAITunableParameter                                 UrgencyGoalWeight;                                       // 0x0118(0x0010) Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_FindInteractable_StatusEffect
	 * Size -> 0x0010 (FullSize[0x0128] - InheritedSize[0x0118])
	 */
	class UAISkill_FindInteractable_StatusEffect : public UAISkill_FindInteractable
	{
	public:
		struct FGameplayTag                                        RequiredPerkFlag;                                        // 0x0118(0x000C) Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       InvertCondition;                                         // 0x0124(0x0001) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_2YHF[0x3];                                   // 0x0125(0x0003) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_FindInteractable_StatusEffect_Plague
	 * Size -> 0x0000 (FullSize[0x0128] - InheritedSize[0x0128])
	 */
	class UAISkill_FindInteractable_StatusEffect_Plague : public UAISkill_FindInteractable_StatusEffect
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_FindInteractable_Waker
	 * Size -> 0x0000 (FullSize[0x0118] - InheritedSize[0x0118])
	 */
	class UAISkill_FindInteractable_Waker : public UAISkill_FindInteractable
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_FindOrb
	 * Size -> 0x0008 (FullSize[0x0108] - InheritedSize[0x0100])
	 */
	class UAISkill_FindOrb : public UAISkill_Find
	{
	public:
		unsigned char                                              UnknownData_4UBR[0x8];                                   // 0x0100(0x0008) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_Interaction
	 * Size -> 0x00B0 (FullSize[0x0170] - InheritedSize[0x00C0])
	 */
	class UAISkill_Interaction : public UAISkill
	{
	public:
		EPawnInputPressTypes                                       inputType;                                               // 0x00C0(0x0001) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EInteractionSkillInputModes                                InputMode;                                               // 0x00C1(0x0001) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EPawnInputPressTypes                                       CancelInputType;                                         // 0x00C2(0x0001) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EInteractionCancelInputModes                               CancelInputMode;                                         // 0x00C3(0x0001) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       AutoLockInput;                                           // 0x00C4(0x0001) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_16SR[0x3];                                   // 0x00C5(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FAIRoll                                             StartRoll;                                               // 0x00C8(0x0024) Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_K8N9[0x4];                                   // 0x00EC(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FString                                              StartInteractionID;                                      // 0x00F0(0x0010) Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FString                                              StopInteractionID;                                       // 0x0100(0x0010) Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      MinHoldInputTime;                                        // 0x0110(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       AutoReleaseHoldInputWhenCharged;                         // 0x0114(0x0001) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_5C7P[0x5B];                                  // 0x0115(0x005B) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_Interaction_AttachRBT
	 * Size -> 0x0000 (FullSize[0x0170] - InheritedSize[0x0170])
	 */
	class UAISkill_Interaction_AttachRBT : public UAISkill_Interaction
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_Interaction_ForThePeople
	 * Size -> 0x0018 (FullSize[0x0188] - InheritedSize[0x0170])
	 */
	class UAISkill_Interaction_ForThePeople : public UAISkill_Interaction
	{
	public:
		unsigned char                                              UnknownData_L99L[0x8];                                   // 0x0170(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FString                                              BlockInteractionId;                                      // 0x0178(0x0010) Edit, ZeroConstructor, DisableEditOnTemplate, HasGetValueTypeHash, NativeAccessSpecifierPublic

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_Interaction_Kill
	 * Size -> 0x0000 (FullSize[0x0170] - InheritedSize[0x0170])
	 */
	class UAISkill_Interaction_Kill : public UAISkill_Interaction
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_Interaction_OrbAbsorb
	 * Size -> 0x0000 (FullSize[0x0170] - InheritedSize[0x0170])
	 */
	class UAISkill_Interaction_OrbAbsorb : public UAISkill_Interaction
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_Interaction_Reel
	 * Size -> 0x0000 (FullSize[0x0170] - InheritedSize[0x0170])
	 */
	class UAISkill_Interaction_Reel : public UAISkill_Interaction
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_Interaction_SendToDeathBed
	 * Size -> 0x0000 (FullSize[0x0170] - InheritedSize[0x0170])
	 */
	class UAISkill_Interaction_SendToDeathBed : public UAISkill_Interaction
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_Interaction_StaticBlast
	 * Size -> 0x0000 (FullSize[0x0170] - InheritedSize[0x0170])
	 */
	class UAISkill_Interaction_StaticBlast : public UAISkill_Interaction
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_InteractionSetTrap
	 * Size -> 0x0010 (FullSize[0x0180] - InheritedSize[0x0170])
	 */
	class UAISkill_InteractionSetTrap : public UAISkill_Interaction
	{
	public:
		class UClass*                                              TrapClass;                                               // 0x0170(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      MaxDistanceFromPointOfInterest;                          // 0x0178(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      MaxDistanceFromAnotherSetTrap;                           // 0x017C(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_InteractionSetTrap_Demogorgon
	 * Size -> 0x0000 (FullSize[0x0180] - InheritedSize[0x0180])
	 */
	class UAISkill_InteractionSetTrap_Demogorgon : public UAISkill_InteractionSetTrap
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_InteractionSetTrap_DreamPallet
	 * Size -> 0x0000 (FullSize[0x0180] - InheritedSize[0x0180])
	 */
	class UAISkill_InteractionSetTrap_DreamPallet : public UAISkill_InteractionSetTrap
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_InteractionSetTrap_DreamSnare
	 * Size -> 0x0000 (FullSize[0x0180] - InheritedSize[0x0180])
	 */
	class UAISkill_InteractionSetTrap_DreamSnare : public UAISkill_InteractionSetTrap
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_InteractionSetTrap_Phantom
	 * Size -> 0x0000 (FullSize[0x0180] - InheritedSize[0x0180])
	 */
	class UAISkill_InteractionSetTrap_Phantom : public UAISkill_InteractionSetTrap
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_InteractionTarget
	 * Size -> 0x00B0 (FullSize[0x0220] - InheritedSize[0x0170])
	 */
	class UAISkill_InteractionTarget : public UAISkill_Interaction
	{
	public:
		EInteractionTargetRequirements                             TargetRequirement;                                       // 0x0170(0x0001) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       AutoSwapBestStimulusWithBestTarget;                      // 0x0171(0x0001) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_1HSQ[0x2];                                   // 0x0172(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      StartMinRange;                                           // 0x0174(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      StartMaxRange;                                           // 0x0178(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      StopMinRange;                                            // 0x017C(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      StopMaxRange;                                            // 0x0180(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      StartMaxHalfAngle;                                       // 0x0184(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      StopMaxHalfAngle;                                        // 0x0188(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       IsMaxHalfAngle2D;                                        // 0x018C(0x0001) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       TestMaxHalfAngleOnPath;                                  // 0x018D(0x0001) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_YS6I[0x2];                                   // 0x018E(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UClass*                                              MaxAngleFilterClass;                                     // 0x0190(0x0008) Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EInteractionTargetInSightModes                             InSightMode;                                             // 0x0198(0x0001) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_M7HP[0x3];                                   // 0x0199(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      OutOfSightModeDelay;                                     // 0x019C(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      TargetMoveAwayTooFastStopDelay;                          // 0x01A0(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      TargetMoveAwayTooFastCooldown;                           // 0x01A4(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       AlwaysStrafeAroundTarget;                                // 0x01A8(0x0001) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_SIZR[0x7];                                   // 0x01A9(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<struct FAIDetectedStimulus>                         _unfilteredTargets;                                      // 0x01B0(0x0010) ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected
		TArray<struct FAIDetectedStimulus>                         _filteredTargets;                                        // 0x01C0(0x0010) ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected
		TMap<class AActor*, struct FTargetMoveAwayToFastInfo>      _targetsMoveAwayTooFastInfo;                             // 0x01D0(0x0050) Transient, NativeAccessSpecifierPrivate

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_InteractionTarget_Aim
	 * Size -> 0x0000 (FullSize[0x0220] - InheritedSize[0x0220])
	 */
	class UAISkill_InteractionTarget_Aim : public UAISkill_InteractionTarget
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_InteractionTarget_AmbushAttack
	 * Size -> 0x0000 (FullSize[0x0220] - InheritedSize[0x0220])
	 */
	class UAISkill_InteractionTarget_AmbushAttack : public UAISkill_InteractionTarget
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_InteractionTarget_AmbushMode
	 * Size -> 0x0000 (FullSize[0x0220] - InheritedSize[0x0220])
	 */
	class UAISkill_InteractionTarget_AmbushMode : public UAISkill_InteractionTarget
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_InteractionTarget_Cloak
	 * Size -> 0x0000 (FullSize[0x0220] - InheritedSize[0x0220])
	 */
	class UAISkill_InteractionTarget_Cloak : public UAISkill_InteractionTarget
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_InteractionTarget_Dash
	 * Size -> 0x0000 (FullSize[0x0220] - InheritedSize[0x0220])
	 */
	class UAISkill_InteractionTarget_Dash : public UAISkill_InteractionTarget
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_InteractionTarget_DashAttack
	 * Size -> 0x0010 (FullSize[0x0230] - InheritedSize[0x0220])
	 */
	class UAISkill_InteractionTarget_DashAttack : public UAISkill_InteractionTarget_Dash
	{
	public:
		float                                                      DashAttackUnderMaxRange;                                 // 0x0220(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      DashAttackUnderMaxHalfAngle;                             // 0x0224(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EAttackType                                                ExpectedAttackType;                                      // 0x0228(0x0001) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_8GWT[0x7];                                   // 0x0229(0x0007) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_InteractionTarget_DashAttack_Cannibal
	 * Size -> 0x0000 (FullSize[0x0230] - InheritedSize[0x0230])
	 */
	class UAISkill_InteractionTarget_DashAttack_Cannibal : public UAISkill_InteractionTarget_DashAttack
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_InteractionTarget_DashAttack_Chainsaw
	 * Size -> 0x0000 (FullSize[0x0230] - InheritedSize[0x0230])
	 */
	class UAISkill_InteractionTarget_DashAttack_Chainsaw : public UAISkill_InteractionTarget_DashAttack
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_InteractionTarget_DashAttack_Demogorgon
	 * Size -> 0x0000 (FullSize[0x0230] - InheritedSize[0x0230])
	 */
	class UAISkill_InteractionTarget_DashAttack_Demogorgon : public UAISkill_InteractionTarget_DashAttack
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_InteractionTarget_DashHillbilly
	 * Size -> 0x0000 (FullSize[0x0220] - InheritedSize[0x0220])
	 */
	class UAISkill_InteractionTarget_DashHillbilly : public UAISkill_InteractionTarget_Dash
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_InteractionTarget_DashOni
	 * Size -> 0x0000 (FullSize[0x0220] - InheritedSize[0x0220])
	 */
	class UAISkill_InteractionTarget_DashOni : public UAISkill_InteractionTarget_Dash
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_InteractionTarget_DeadHard
	 * Size -> 0x0000 (FullSize[0x0220] - InheritedSize[0x0220])
	 */
	class UAISkill_InteractionTarget_DeadHard : public UAISkill_InteractionTarget
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_InteractionTarget_DemonMode
	 * Size -> 0x0000 (FullSize[0x0220] - InheritedSize[0x0220])
	 */
	class UAISkill_InteractionTarget_DemonMode : public UAISkill_InteractionTarget
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_InteractionTarget_Fire
	 * Size -> 0x0000 (FullSize[0x0220] - InheritedSize[0x0220])
	 */
	class UAISkill_InteractionTarget_Fire : public UAISkill_InteractionTarget
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_InteractionTarget_Frenzy
	 * Size -> 0x0000 (FullSize[0x0220] - InheritedSize[0x0220])
	 */
	class UAISkill_InteractionTarget_Frenzy : public UAISkill_InteractionTarget
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_InteractionTarget_LungeAttack
	 * Size -> 0x0000 (FullSize[0x0220] - InheritedSize[0x0220])
	 */
	class UAISkill_InteractionTarget_LungeAttack : public UAISkill_InteractionTarget
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_InteractionTarget_PhaseWalk
	 * Size -> 0x0000 (FullSize[0x0220] - InheritedSize[0x0220])
	 */
	class UAISkill_InteractionTarget_PhaseWalk : public UAISkill_InteractionTarget
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_InteractionTarget_ReloadDeathSlinger
	 * Size -> 0x0000 (FullSize[0x0220] - InheritedSize[0x0220])
	 */
	class UAISkill_InteractionTarget_ReloadDeathSlinger : public UAISkill_InteractionTarget
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_InteractionTarget_ShockTherapy
	 * Size -> 0x0008 (FullSize[0x0228] - InheritedSize[0x0220])
	 */
	class UAISkill_InteractionTarget_ShockTherapy : public UAISkill_InteractionTarget
	{
	public:
		float                                                      TargetToEvadePointMaxDistance;                           // 0x0220(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      CastShockTimeBuffer;                                     // 0x0224(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_InteractionTarget_Stalk
	 * Size -> 0x0000 (FullSize[0x0220] - InheritedSize[0x0220])
	 */
	class UAISkill_InteractionTarget_Stalk : public UAISkill_InteractionTarget
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_InteractionTarget_StalkGhost
	 * Size -> 0x0010 (FullSize[0x0230] - InheritedSize[0x0220])
	 */
	class UAISkill_InteractionTarget_StalkGhost : public UAISkill_InteractionTarget_Stalk
	{
	public:
		float                                                      CautiousModeUnderTargetRange;                            // 0x0220(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      CautiousModeSpeedFactor;                                 // 0x0224(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      BackFromCautiousDelay;                                   // 0x0228(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_HDCV[0x4];                                   // 0x022C(0x0004) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_InteractionTarget_StalkShape
	 * Size -> 0x0008 (FullSize[0x0228] - InheritedSize[0x0220])
	 */
	class UAISkill_InteractionTarget_StalkShape : public UAISkill_InteractionTarget_Stalk
	{
	public:
		int32_t                                                    StalkRangeLimitedAtEvilTier;                             // 0x0220(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      MaxStalkRangeWhenLimitedByEvilTier;                      // 0x0224(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_InteractionTarget_StealthGhost
	 * Size -> 0x0008 (FullSize[0x0228] - InheritedSize[0x0220])
	 */
	class UAISkill_InteractionTarget_StealthGhost : public UAISkill_InteractionTarget
	{
	public:
		float                                                      CrouchSwapDelay;                                         // 0x0220(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_LE1H[0x4];                                   // 0x0224(0x0004) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_InteractionTarget_Throw
	 * Size -> 0x0078 (FullSize[0x0298] - InheritedSize[0x0220])
	 */
	class UAISkill_InteractionTarget_Throw : public UAISkill_InteractionTarget
	{
	public:
		EAIThrowPredictionModes                                    ThrowPredictionMode;                                     // 0x0220(0x0001) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_TSZQ[0x3];                                   // 0x0221(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		int32_t                                                    MaxAddPitchAngle;                                        // 0x0224(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EAIThrowProjectileModes                                    ThrowProjectileMode;                                     // 0x0228(0x0001) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_9JV7[0x3];                                   // 0x0229(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FAITunableParameter                                 HoldInputTimeRandDeviation;                              // 0x022C(0x0010) Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic
		struct FAITunableParameter                                 PitchAngleRandDeviation;                                 // 0x023C(0x0010) Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_6KXY[0x4C];                                  // 0x024C(0x004C) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_InteractionTarget_ThrowHatchet
	 * Size -> 0x0000 (FullSize[0x0298] - InheritedSize[0x0298])
	 */
	class UAISkill_InteractionTarget_ThrowHatchet : public UAISkill_InteractionTarget_Throw
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_InteractionTarget_ThrowPlague
	 * Size -> 0x0010 (FullSize[0x02A8] - InheritedSize[0x0298])
	 */
	class UAISkill_InteractionTarget_ThrowPlague : public UAISkill_InteractionTarget_Throw
	{
	public:
		struct FGameplayTag                                        ProjectileDamageSickTargetTag;                           // 0x0298(0x000C) Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_DFKS[0x4];                                   // 0x02A4(0x0004) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_InteractionTarget_TormentAttack
	 * Size -> 0x0030 (FullSize[0x0250] - InheritedSize[0x0220])
	 */
	class UAISkill_InteractionTarget_TormentAttack : public UAISkill_InteractionTarget
	{
	public:
		int32_t                                                    AdvancedAtNbDetectedTargets;                             // 0x0220(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FAIRoll                                             AdvancedStartRoll;                                       // 0x0224(0x0024) Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_72QL[0x8];                                   // 0x0248(0x0008) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_InteractionTarget_TormentMode
	 * Size -> 0x0010 (FullSize[0x0230] - InheritedSize[0x0220])
	 */
	class UAISkill_InteractionTarget_TormentMode : public UAISkill_InteractionTarget
	{
	public:
		float                                                      ChasedTargetToEvadePointMaxDistance;                     // 0x0220(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      StartTormentInPatrolAboveChargeRatio;                    // 0x0224(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      StartTormentInChaseAboveChargeRatio;                     // 0x0228(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_LS6V[0x4];                                   // 0x022C(0x0004) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_InteractionTeleport
	 * Size -> 0x0008 (FullSize[0x0178] - InheritedSize[0x0170])
	 */
	class UAISkill_InteractionTeleport : public UAISkill_Interaction
	{
	public:
		float                                                      BlockTeleportWhenPathGoalUnderRange;                     // 0x0170(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_AJDO[0x4];                                   // 0x0174(0x0004) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_InteractionTeleportEthereal
	 * Size -> 0x0060 (FullSize[0x01D8] - InheritedSize[0x0178])
	 */
	class UAISkill_InteractionTeleportEthereal : public UAISkill_InteractionTeleport
	{
	public:
		float                                                      TeleportPlanInterval;                                    // 0x0178(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      MaxTeleportAlignHalfAngle;                               // 0x017C(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      AbortNotWorkingTeleportDelay;                            // 0x0180(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      AbortAddRunCooldownPenaltyTime;                          // 0x0184(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_CXKF[0x18];                                  // 0x0188(0x0018) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class AActor*                                              _onStimulusInstigator;                                   // 0x01A0(0x0008) ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_OYCF[0x30];                                  // 0x01A8(0x0030) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_InteractionTeleportEthereal_Blink
	 * Size -> 0x0010 (FullSize[0x01E8] - InheritedSize[0x01D8])
	 */
	class UAISkill_InteractionTeleportEthereal_Blink : public UAISkill_InteractionTeleportEthereal
	{
	public:
		float                                                      StartBlinkAtWarpLocationRange;                           // 0x01D8(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      ValidateBlinkWarpRange;                                  // 0x01DC(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      BlinkAboveSavedPathLength;                               // 0x01E0(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      BlinkIfTargetWillBeInRange;                              // 0x01E4(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_InteractionTeleportEthereal_Demogorgon
	 * Size -> 0x0018 (FullSize[0x01F0] - InheritedSize[0x01D8])
	 */
	class UAISkill_InteractionTeleportEthereal_Demogorgon : public UAISkill_InteractionTeleportEthereal
	{
	public:
		float                                                      MaxRangeFromFirstPortal;                                 // 0x01D8(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_TH7V[0x4];                                   // 0x01DC(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class ADemogorgonPortal*                                   _firstPortal;                                            // 0x01E0(0x0008) ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class ADemogorgonPortal*                                   _secondPortal;                                           // 0x01E8(0x0008) ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_InteractionTeleportEthereal_Nightmare
	 * Size -> 0x0010 (FullSize[0x01E8] - InheritedSize[0x01D8])
	 */
	class UAISkill_InteractionTeleportEthereal_Nightmare : public UAISkill_InteractionTeleportEthereal
	{
	public:
		float                                                      TeleportIfPathLengthSavedAboveRange;                     // 0x01D8(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_IP5F[0x4];                                   // 0x01DC(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class AGenerator*                                          _toGenerator;                                            // 0x01E0(0x0008) ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_InteractionUseItem
	 * Size -> 0x0008 (FullSize[0x0178] - InheritedSize[0x0170])
	 */
	class UAISkill_InteractionUseItem : public UAISkill_Interaction
	{
	public:
		ELoadoutItemType                                           ItemType;                                                // 0x0170(0x0001) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_T0WU[0x7];                                   // 0x0171(0x0007) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_InteractionUseItem_Firecracker
	 * Size -> 0x0018 (FullSize[0x0190] - InheritedSize[0x0178])
	 */
	class UAISkill_InteractionUseItem_Firecracker : public UAISkill_InteractionUseItem
	{
	public:
		struct FAITunableParameter                                 StartMaxRange;                                           // 0x0178(0x0010) Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic
		float                                                      TargetFaceMeMaxAngle;                                    // 0x0188(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_N1ZP[0x4];                                   // 0x018C(0x0004) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_InteractionUseItem_Flashlight
	 * Size -> 0x0068 (FullSize[0x01E0] - InheritedSize[0x0178])
	 */
	class UAISkill_InteractionUseItem_Flashlight : public UAISkill_InteractionUseItem
	{
	public:
		struct FAIRoll                                             VulnerableTargetStartRoll;                               // 0x0178(0x0024) Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic
		float                                                      TargetFaceMeMaxAngle;                                    // 0x019C(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class AActor*                                              _targetActor;                                            // 0x01A0(0x0008) ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_CRBA[0x38];                                  // 0x01A8(0x0038) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_InteractionUseItem_Map
	 * Size -> 0x0000 (FullSize[0x0178] - InheritedSize[0x0178])
	 */
	class UAISkill_InteractionUseItem_Map : public UAISkill_InteractionUseItem
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_PossessTheKiller
	 * Size -> 0x0000 (FullSize[0x0170] - InheritedSize[0x0170])
	 */
	class UAISkill_PossessTheKiller : public UAISkill_Interaction
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_SkillCheck
	 * Size -> 0x0050 (FullSize[0x0110] - InheritedSize[0x00C0])
	 */
	class UAISkill_SkillCheck : public UAISkill
	{
	public:
		struct FAIRoll                                             RegularZoneRoll;                                         // 0x00C0(0x0024) Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic
		struct FAIRoll                                             BonusZoneRoll;                                           // 0x00E4(0x0024) Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_UATI[0x8];                                   // 0x0108(0x0008) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_Strafe
	 * Size -> 0x0070 (FullSize[0x0130] - InheritedSize[0x00C0])
	 */
	class UAISkill_Strafe : public UAISkill
	{
	public:
		float                                                      StartMaxRange;                                           // 0x00C0(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      StopMaxRange;                                            // 0x00C4(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      StrafeBackwardRange;                                     // 0x00C8(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      StrafeFowardRange;                                       // 0x00CC(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      IgnoreUnderNavLinkStartRange;                            // 0x00D0(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       PauseStrafeOnAnimation;                                  // 0x00D4(0x0001) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_9DBA[0x3];                                   // 0x00D5(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FAITunableParameter                                 StrafeHoldInterval;                                      // 0x00D8(0x0010) Edit, DisableEditOnTemplate, NoDestructor, NativeAccessSpecifierPublic
		struct FAITunableParameter                                 StrafeHoldDeviation;                                     // 0x00E8(0x0010) Edit, DisableEditOnTemplate, NoDestructor, NativeAccessSpecifierPublic
		struct FAITunableParameter                                 StrafePauseInterval;                                     // 0x00F8(0x0010) Edit, DisableEditOnTemplate, NoDestructor, NativeAccessSpecifierPublic
		struct FAITunableParameter                                 StrafePauseDeviation;                                    // 0x0108(0x0010) Edit, DisableEditOnTemplate, NoDestructor, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_PUR8[0x18];                                  // 0x0118(0x0018) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_StrafeChained
	 * Size -> 0x0000 (FullSize[0x0130] - InheritedSize[0x0130])
	 */
	class UAISkill_StrafeChained : public UAISkill_Strafe
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_StrafeDodge
	 * Size -> 0x0028 (FullSize[0x0158] - InheritedSize[0x0130])
	 */
	class UAISkill_StrafeDodge : public UAISkill_Strafe
	{
	public:
		struct FAIRoll                                             StartRoll;                                               // 0x0130(0x0024) Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_6XL5[0x4];                                   // 0x0154(0x0004) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_ThroughTorment
	 * Size -> 0x0008 (FullSize[0x00C8] - InheritedSize[0x00C0])
	 */
	class UAISkill_ThroughTorment : public UAISkill
	{
	public:
		EAITerrorLevel                                             ToleratedTerrorPressure;                                 // 0x00C0(0x0001) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_D6BQ[0x7];                                   // 0x00C1(0x0007) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDBots.AISkill_Wiggle
