#pragma once

/**
 * Name: DBD
 * Version: 601
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Classes
	// --------------------------------------------------
	/**
	 * Class DBDUIViewsCore.AspectRatioBox
	 * Size -> 0x0018 (FullSize[0x0160] - InheritedSize[0x0148])
	 */
	class UAspectRatioBox : public UContentWidget
	{
	public:
		float                                                      AspectRatio;                                             // 0x0148(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              IsAspectRatioOverridden : 1;                             // 0x014C(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_72PV[0x13];                                  // 0x014D(0x0013) MISSED OFFSET (PADDING)

	public:
		void SetAspectRatio(float inAspectRatio);
		void ClearAspectRatio();
		static UClass* StaticClass();
	};

	/**
	 * Class DBDUIViewsCore.AspectRatioBoxSlot
	 * Size -> 0x0028 (FullSize[0x0068] - InheritedSize[0x0040])
	 */
	class UAspectRatioBoxSlot : public UPanelSlot
	{
	public:
		struct FMargin                                             Padding;                                                 // 0x0040(0x0010) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic
		EHorizontalAlignment                                       HorizontalAlignment;                                     // 0x0050(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EVerticalAlignment                                         VerticalAlignment;                                       // 0x0051(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_MYZD[0x16];                                  // 0x0052(0x0016) MISSED OFFSET (PADDING)

	public:
		void SetVerticalAlignment(EVerticalAlignment inVerticalAlignment);
		void SetPadding(const struct FMargin& InPadding);
		void SetHorizontalAlignment(EHorizontalAlignment inHorizontalAlignment);
		static UClass* StaticClass();
	};

	/**
	 * Class DBDUIViewsCore.CoreBaseUserWidget
	 * Size -> 0x0078 (FullSize[0x0310] - InheritedSize[0x0298])
	 */
	class UCoreBaseUserWidget : public UUserWidget
	{
	public:
		unsigned char                                              UnknownData_81EU[0x10];                                  // 0x0298(0x0010) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UScaleBox*                                           ScaleContainer;                                          // 0x02A8(0x0008) BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		bool                                                       IsInteractive;                                           // 0x02B0(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		EControlMode                                               _controlMode;                                            // 0x02B1(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		EScaleType                                                 ScaleType;                                               // 0x02B2(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_S9NM[0x5];                                   // 0x02B3(0x0005) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UDBDInputManager*                                    _inputManager;                                           // 0x02B8(0x0008) ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		TMap<class FName, class UWidgetAnimation*>                 _animationMap;                                           // 0x02C0(0x0050) Transient, NativeAccessSpecifierPrivate

	public:
		void UpdateScale(float Scale);
		void RegisterForInput();
		void OnControlModeChangedBP(EControlMode controlMode);
		void DeregisterFromInput();
		static UClass* StaticClass();
	};

	/**
	 * Class DBDUIViewsCore.CharacterTooltipWidget
	 * Size -> 0x0020 (FullSize[0x0330] - InheritedSize[0x0310])
	 */
	class UCharacterTooltipWidget : public UCoreBaseUserWidget
	{
	public:
		class UDBDTextBlock*                                       InstructionTB;                                           // 0x0310(0x0008) BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class UDBDTextBlock*                                       LevelTB;                                                 // 0x0318(0x0008) BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class UDBDTextBlock*                                       MarketTB;                                                // 0x0320(0x0008) BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class UDBDRichTextBlock*                                   DifficultyRTB;                                           // 0x0328(0x0008) BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected

	public:
		void SetTooltipData(const struct FCharacterTooltipViewData& characterViewData);
		void SetLevel(int32_t Level);
		void SetDifficulty(ECharacterDifficulty Difficulty);
		static UClass* StaticClass();
	};

	/**
	 * Class DBDUIViewsCore.CoreBaseLoadoutPartWidget
	 * Size -> 0x0018 (FullSize[0x02B0] - InheritedSize[0x0298])
	 */
	class UCoreBaseLoadoutPartWidget : public UUserWidget
	{
	public:
		class UDBDImage*                                           ImageRarity;                                             // 0x0298(0x0008) BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class UDBDImage*                                           ImageIcon;                                               // 0x02A0(0x0008) BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class UTextBlock*                                          TextStackCount;                                          // 0x02A8(0x0008) BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected

	public:
		void SetLoadoutStackCount(int32_t StackCount);
		void SetLoadoutPartRarity(EItemRarity Rarity);
		void SetLoadoutPartIcon();
		static UClass* StaticClass();
	};

	/**
	 * Class DBDUIViewsCore.CoreAddonWidget
	 * Size -> 0x0008 (FullSize[0x02B8] - InheritedSize[0x02B0])
	 */
	class UCoreAddonWidget : public UCoreBaseLoadoutPartWidget
	{
	public:
		unsigned char                                              UnknownData_G2XE[0x8];                                   // 0x02B0(0x0008) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDUIViewsCore.CoreBaseHudWidget
	 * Size -> 0x0018 (FullSize[0x0328] - InheritedSize[0x0310])
	 */
	class UCoreBaseHudWidget : public UCoreBaseUserWidget
	{
	public:
		float                                                      FocusAnimationDuration;                                  // 0x0310(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		float                                                      FocusAnimationDelay;                                     // 0x0314(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		EEasingType                                                FocusAnimationEasing;                                    // 0x0318(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_AWEG[0x3];                                   // 0x0319(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      FocusAnimationMaxOpacity;                                // 0x031C(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		float                                                      FocusAnimationMinOpacity;                                // 0x0320(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_6D8E[0x4];                                   // 0x0324(0x0004) MISSED OFFSET (PADDING)

	public:
		bool ShouldPlayFocusAnimation();
		void PlayFocusAnimation();
		static UClass* StaticClass();
	};

	/**
	 * Class DBDUIViewsCore.CoreButtonPromptWidget
	 * Size -> 0x0038 (FullSize[0x0348] - InheritedSize[0x0310])
	 */
	class UCoreButtonPromptWidget : public UCoreBaseUserWidget
	{
	public:
		class UAkAudioEvent*                                       CursorOverSfx;                                           // 0x0310(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class UAkAudioEvent*                                       CursorPressSfx;                                          // 0x0318(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class UAkAudioEvent*                                       CursorReleaseSfx;                                        // 0x0320(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class UCoreInputPromptTextWidget*                          _inputPromptText;                                        // 0x0328(0x0008) BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class UTextBlock*                                          _buttonTextField;                                        // 0x0330(0x0008) BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class FScriptMulticastDelegate                             _buttonPromptTriggeredDelegate;                          // 0x0338(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPrivate

	public:
		void SetText(const class FText& Text);
		void SetInputKey(const struct FKey& Key);
		void SetAction(EUIActionType ActionType);
		void EnablePrompts();
		void DisablePrompts();
		static UClass* StaticClass();
	};

	/**
	 * Class DBDUIViewsCore.CoreButtonSelector
	 * Size -> 0x0050 (FullSize[0x0360] - InheritedSize[0x0310])
	 */
	class UCoreButtonSelector : public UCoreBaseUserWidget
	{
	public:
		class FScriptMulticastDelegate                             OnSelectedDelegate;                                      // 0x0310(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnSelectedAgainDelegate;                                 // 0x0320(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnUnselectedDelegate;                                    // 0x0330(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		TArray<class UCoreSelectableButtonWidget*>                 _buttons;                                                // 0x0340(0x0010) ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_1BV3[0x10];                                  // 0x0350(0x0010) MISSED OFFSET (PADDING)

	public:
		void UnselectCurrent();
		void SetAllEnabled(bool Enabled);
		bool SelectPrevious();
		bool SelectNext();
		bool Select(class UCoreSelectableButtonWidget* buttonToSelect);
		void OnUnselectedDelegate__DelegateSignature(class UCoreSelectableButtonWidget* unselectedButton);
		void OnSelectedDelegate__DelegateSignature(class UCoreSelectableButtonWidget* selectedButton);
		void OnSelectedAgainDelegate__DelegateSignature(class UCoreSelectableButtonWidget* selectedButton);
		void OnButtonSelectedChanged(class UCoreSelectableButtonWidget* selectedButton, bool IsSelected);
		void OnButtonSelectedAgain(class UCoreSelectableButtonWidget* selectedButton);
		bool HasSelection();
		static UClass* StaticClass();
	};

	/**
	 * Class DBDUIViewsCore.CoreButtonWidget
	 * Size -> 0x00C0 (FullSize[0x03D0] - InheritedSize[0x0310])
	 */
	class UCoreButtonWidget : public UCoreBaseUserWidget
	{
	public:
		class FScriptMulticastDelegate                             OnHoveredDelegate;                                       // 0x0310(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnUnhoveredDelegate;                                     // 0x0320(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnPressedDelegate;                                       // 0x0330(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnReleasedDelegate;                                      // 0x0340(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnClickedDelegate;                                       // 0x0350(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FString                                              HoveredSfxName;                                          // 0x0360(0x0010) Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UAkAudioEvent*                                       HoveredSfx;                                              // 0x0370(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FString                                              PressedSfxName;                                          // 0x0378(0x0010) Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UAkAudioEvent*                                       PressedSfx;                                              // 0x0388(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FString                                              ClickedSfxName;                                          // 0x0390(0x0010) Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UAkAudioEvent*                                       ClickedSfx;                                              // 0x03A0(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EAnalogCursorStickiness                                    AnalogCursorStickiness;                                  // 0x03A8(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_NNOL[0x7];                                   // 0x03A9(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UDBDButton*                                          HitzoneButton;                                           // 0x03B0(0x0008) BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class UDBDTextBlock*                                       LabelTB;                                                 // 0x03B8(0x0008) BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_GXBD[0x10];                                  // 0x03C0(0x0010) MISSED OFFSET (PADDING)

	public:
		void SetVisible(EButtonWidgetVisibility visible);
		void SetPressable(bool isPressable);
		void SetLabel(const class FText& label);
		void SetHoverable(bool isHoverable);
		void SetHoldable(bool isHoldable);
		void SetEnabled(bool IsEnabled);
		void SetClickable(bool isClickable);
		void SetChargeable(bool isChargeable);
		void OnUnhoveredDelegate__DelegateSignature(class UCoreButtonWidget* buttonTarget);
		void OnUnhovered();
		void OnReleasedDelegate__DelegateSignature(class UCoreButtonWidget* buttonTarget);
		void OnReleased();
		void OnPressedDelegate__DelegateSignature(class UCoreButtonWidget* buttonTarget);
		void OnPressed();
		void OnInternalUnhovered();
		void OnInternalReleased();
		void OnInternalPressed();
		void OnInternalHovered();
		void OnInternalClicked();
		void OnHoveredDelegate__DelegateSignature(class UCoreButtonWidget* buttonTarget);
		void OnHovered();
		void OnEnabledChanged(bool IsEnabled);
		void OnClickedDelegate__DelegateSignature(class UCoreButtonWidget* buttonTarget);
		void OnClicked();
		bool IsEnabled();
		static UClass* StaticClass();
	};

	/**
	 * Class DBDUIViewsCore.CoreRewardWidget
	 * Size -> 0x0010 (FullSize[0x03E0] - InheritedSize[0x03D0])
	 */
	class UCoreRewardWidget : public UCoreButtonWidget
	{
	public:
		class UDBDImage*                                           RewardIcon;                                              // 0x03D0(0x0008) BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class UOverlay*                                            LockStateContainer;                                      // 0x03D8(0x0008) BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected

	public:
		void SetIsLocked(bool IsLocked);
		void ClearData();
		static UClass* StaticClass();
	};

	/**
	 * Class DBDUIViewsCore.CoreCharacterRewardWidget
	 * Size -> 0x0000 (FullSize[0x03E0] - InheritedSize[0x03E0])
	 */
	class UCoreCharacterRewardWidget : public UCoreRewardWidget
	{
	public:
		void SetData(const struct FCharacterRewardViewData& CharacterRewardViewData);
		static UClass* StaticClass();
	};

	/**
	 * Class DBDUIViewsCore.CoreCreditsWidget
	 * Size -> 0x0038 (FullSize[0x0348] - InheritedSize[0x0310])
	 */
	class UCoreCreditsWidget : public UCoreBaseUserWidget
	{
	public:
		unsigned char                                              UnknownData_QU0Z[0x8];                                   // 0x0310(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      ScrollSpeed;                                             // 0x0318(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_DY4Q[0x4];                                   // 0x031C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UCoreInputSwitcherWidget*                            BackInputSwitcher;                                       // 0x0320(0x0008) BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class UDBDRichTextBlock*                                   CreditsTextBlock;                                        // 0x0328(0x0008) BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class FScriptMulticastDelegate                             _backActionDelegate;                                     // 0x0330(0x0010) ZeroConstructor, InstancedReference, BlueprintCallable, NativeAccessSpecifierPrivate
		class UUITweenInstance*                                    _tween;                                                  // 0x0340(0x0008) ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate

	public:
		void ScrollText();
		void OnScrollEnd(class UUITweenInstance* tween);
		static UClass* StaticClass();
	};

	/**
	 * Class DBDUIViewsCore.CoreCurrencyProgressionRewardWidget
	 * Size -> 0x0000 (FullSize[0x03E0] - InheritedSize[0x03E0])
	 */
	class UCoreCurrencyProgressionRewardWidget : public UCoreRewardWidget
	{
	public:
		void SetData(const struct FCurrencyProgressionRewardViewData& CurrencyProgressionRewardViewData);
		static UClass* StaticClass();
	};

	/**
	 * Class DBDUIViewsCore.CoreCustomizationRewardWidget
	 * Size -> 0x0000 (FullSize[0x03E0] - InheritedSize[0x03E0])
	 */
	class UCoreCustomizationRewardWidget : public UCoreRewardWidget
	{
	public:
		void SetData(const struct FCustomizationRewardViewData& CustomizationRewardViewData);
		static UClass* StaticClass();
	};

	/**
	 * Class DBDUIViewsCore.CoreEndGameCollapseBarWidget
	 * Size -> 0x0078 (FullSize[0x03A0] - InheritedSize[0x0328])
	 */
	class UCoreEndGameCollapseBarWidget : public UCoreBaseHudWidget
	{
	public:
		unsigned char                                              UnknownData_K01S[0x8];                                   // 0x0328(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      _progressBarInterpSpeed;                                 // 0x0330(0x0004) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_HT7R[0x6C];                                  // 0x0334(0x006C) MISSED OFFSET (PADDING)

	public:
		void UpdateBarProgression(float Progress);
		void PlayToZeroAnimation();
		static UClass* StaticClass();
	};

	/**
	 * Class DBDUIViewsCore.CoreEndGameCollapseProgressWidget
	 * Size -> 0x0048 (FullSize[0x0358] - InheritedSize[0x0310])
	 */
	class UCoreEndGameCollapseProgressWidget : public UCoreBaseUserWidget
	{
	public:
		class UProgressBar*                                        ProgressBar;                                             // 0x0310(0x0008) BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class UCanvasPanel*                                        MarkerLeftCanvas;                                        // 0x0318(0x0008) BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class UCanvasPanel*                                        MarkerRightCanvas;                                       // 0x0320(0x0008) BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class UHorizontalBoxSlot*                                  _markerLeftBox;                                          // 0x0328(0x0008) ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class UHorizontalBoxSlot*                                  _markerRightBox;                                         // 0x0330(0x0008) ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_RR9N[0x20];                                  // 0x0338(0x0020) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDUIViewsCore.CoreEquippedItemWidget
	 * Size -> 0x0010 (FullSize[0x0338] - InheritedSize[0x0328])
	 */
	class UCoreEquippedItemWidget : public UCoreBaseHudWidget
	{
	public:
		unsigned char                                              UnknownData_DHE7[0x8];                                   // 0x0328(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UAkAudioEvent*                                       ItemDisappearSfx;                                        // 0x0330(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDUIViewsCore.CoreEquippedPowerWidget
	 * Size -> 0x0008 (FullSize[0x0330] - InheritedSize[0x0328])
	 */
	class UCoreEquippedPowerWidget : public UCoreBaseHudWidget
	{
	public:
		unsigned char                                              UnknownData_RRA7[0x8];                                   // 0x0328(0x0008) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDUIViewsCore.CoreExampleWidget
	 * Size -> 0x0098 (FullSize[0x03C0] - InheritedSize[0x0328])
	 */
	class UCoreExampleWidget : public UCoreBaseHudWidget
	{
	public:
		unsigned char                                              UnknownData_IE0N[0x8];                                   // 0x0328(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FString                                              EditAnywhere;                                            // 0x0330(0x0010) Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FString                                              EditDefaultsOnly;                                        // 0x0340(0x0010) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FString                                              EditInstanceOnly;                                        // 0x0350(0x0010) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FString                                              EditNoBlueprint;                                         // 0x0360(0x0010) Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FString                                              EditDefaultsOnlyBlueprintReadOnly;                       // 0x0370(0x0010) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FString                                              VisibleAnywhere;                                         // 0x0380(0x0010) Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FString                                              VisibleDefaultsOnly;                                     // 0x0390(0x0010) Edit, ZeroConstructor, DisableEditOnInstance, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FString                                              VisibleInstanceOnly;                                     // 0x03A0(0x0010) Edit, ZeroConstructor, DisableEditOnTemplate, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             ExampleButtonClickDelegate;                              // 0x03B0(0x0010) ZeroConstructor, InstancedReference, BlueprintCallable, NativeAccessSpecifierPrivate

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDUIViewsCore.CoreExternalEffectsWidget
	 * Size -> 0x0278 (FullSize[0x05A0] - InheritedSize[0x0328])
	 */
	class UCoreExternalEffectsWidget : public UCoreBaseHudWidget
	{
	public:
		unsigned char                                              UnknownData_MD8X[0x8];                                   // 0x0328(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FVector2D                                           GridSlotSize;                                            // 0x0330(0x0008) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		float                                                      AddonScaleRatio;                                         // 0x0338(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		int32_t                                                    SpacingBetweenRows;                                      // 0x033C(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		int32_t                                                    SpacingPerks;                                            // 0x0340(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		int32_t                                                    SpacingAddons;                                           // 0x0344(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		int32_t                                                    SpacingBetweenPerksAndAddons;                            // 0x0348(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_AJQ4[0x4];                                   // 0x034C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UClass*                                              PerkWidgetClass;                                         // 0x0350(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, NoClear, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class UClass*                                              AddonWidgetClass;                                        // 0x0358(0x0008) Edit, ZeroConstructor, DisableEditOnInstance, NoClear, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class UGridPanel*                                          Container;                                               // 0x0360(0x0008) BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_XE5E[0x8];                                   // 0x0368(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<struct FPerkViewData>                               _perkData;                                               // 0x0370(0x0010) ZeroConstructor, Transient, NativeAccessSpecifierPrivate
		TMap<class FName, class UCorePerkWidget*>                  _perkWidgets;                                            // 0x0380(0x0050) ExportObject, Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate
		TArray<class UCorePerkWidget*>                             _perkPool;                                               // 0x03D0(0x0010) ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate
		unsigned char                                              _perkViewInterfaces[0x50];                               // 0x03E0(0x0050) UNKNOWN PROPERTY: MapProperty
		TArray<struct FAddonViewData>                              _addonData;                                              // 0x0430(0x0010) ZeroConstructor, Transient, NativeAccessSpecifierPrivate
		TMap<class FName, class UCoreAddonWidget*>                 _addonWidgets;                                           // 0x0440(0x0050) ExportObject, Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate
		TArray<class UCoreAddonWidget*>                            _addonPool;                                              // 0x0490(0x0010) ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate
		unsigned char                                              _addonViewInterfaces[0x50];                              // 0x04A0(0x0050) UNKNOWN PROPERTY: MapProperty
		TMap<class FName, struct FTimerHandle>                     _timerHandleMap;                                         // 0x04F0(0x0050) Transient, NativeAccessSpecifierPrivate
		TMap<class FName, class USpacer*>                          _spacerWidgets;                                          // 0x0540(0x0050) ExportObject, Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate
		TArray<class USpacer*>                                     _spacerPool;                                             // 0x0590(0x0010) ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate

	public:
		void HideExternalPerk(const class FName& perkId);
		void HideExternalAddon(const class FName& AddonID);
		static UClass* StaticClass();
	};

	/**
	 * Class DBDUIViewsCore.CoreGameManualCategoryButton
	 * Size -> 0x0030 (FullSize[0x0400] - InheritedSize[0x03D0])
	 */
	class UCoreGameManualCategoryButton : public UCoreButtonWidget
	{
	public:
		class UDBDTextBlock*                                       Title;                                                   // 0x03D0(0x0008) BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UDBDTextBlock*                                       Description;                                             // 0x03D8(0x0008) BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UDBDImage*                                           Icon;                                                    // 0x03E0(0x0008) BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UDBDImage*                                           Background;                                              // 0x03E8(0x0008) BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UTexture2D*                                          IconTexture;                                             // 0x03F0(0x0008) Edit, ZeroConstructor, DisableEditOnTemplate, NoClear, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UTexture2D*                                          BackgroundTexture;                                       // 0x03F8(0x0008) Edit, ZeroConstructor, DisableEditOnTemplate, NoClear, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic

	public:
		void SetText(const class FText& Title, const class FText& Description);
		static UClass* StaticClass();
	};

	/**
	 * Class DBDUIViewsCore.CoreGameManualPanelWidget
	 * Size -> 0x00D8 (FullSize[0x03E8] - InheritedSize[0x0310])
	 */
	class UCoreGameManualPanelWidget : public UCoreBaseUserWidget
	{
	public:
		unsigned char                                              UnknownData_R36H[0x8];                                   // 0x0310(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		EGameManualMenuState                                       _currentSelectedManualMenu;                              // 0x0318(0x0001) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		EHelpType                                                  _currentGameManualTopic;                                 // 0x0319(0x0001) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_3N6M[0x6];                                   // 0x031A(0x0006) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UPanelWidget*                                        CategoryPanel;                                           // 0x0320(0x0008) BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class UCoreGameManualCategoryButton*                       GameCategoryButton;                                      // 0x0328(0x0008) BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class UCoreGameManualCategoryButton*                       SurvivorCategoryButton;                                  // 0x0330(0x0008) BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class UCoreGameManualCategoryButton*                       KillerCategoryButton;                                    // 0x0338(0x0008) BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class UPanelWidget*                                        TopicsPanel;                                             // 0x0340(0x0008) BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class UCoreTabContainerWidget*                             GameManualTopicsTabs;                                    // 0x0348(0x0008) BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class UDBDTextBlock*                                       GameManualContentTitle;                                  // 0x0350(0x0008) BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class UDBDTextBlock*                                       GameManualContentSubtitle;                               // 0x0358(0x0008) BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class UDBDRichTextBlock*                                   GameManualContentText;                                   // 0x0360(0x0008) BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class FScriptMulticastDelegate                             _onSetOnboardingMenuSubtitleDelegate;                    // 0x0368(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate
		class FScriptMulticastDelegate                             _onResetOnboardingMenuSubtitleDelegate;                  // 0x0378(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_APTO[0x60];                                  // 0x0388(0x0060) MISSED OFFSET (PADDING)

	public:
		void ToggleGameManualMenuState();
		void ShowHelpTopics(EHelpType categoryType);
		void SetGameManualMenuState(EGameManualMenuState menuState);
		void SetCurrentOnbardingMenuSubtitle();
		void ResetScrolls(bool resetTopicsScroll);
		void OnTopicsTabSelected(class UCoreSelectableButtonWidget* selectedButton);
		static UClass* StaticClass();
	};

	/**
	 * Class DBDUIViewsCore.CoreGenericPopupWidget
	 * Size -> 0x0050 (FullSize[0x0360] - InheritedSize[0x0310])
	 */
	class UCoreGenericPopupWidget : public UCoreBaseUserWidget
	{
	public:
		unsigned char                                              UnknownData_HCJU[0x8];                                   // 0x0310(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UDBDTextBlock*                                       TitleText;                                               // 0x0318(0x0008) BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class UDBDRichTextBlock*                                   MessageText;                                             // 0x0320(0x0008) BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class UCoreInputSwitcherWidget*                            ProgressionButton;                                       // 0x0328(0x0008) BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class UCoreInputSwitcherWidget*                            RegressionButton;                                        // 0x0330(0x0008) BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class UCoreInputSwitcherWidget*                            AlternativeButton;                                       // 0x0338(0x0008) BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class FScriptMulticastDelegate                             _popupActionDelegate;                                    // 0x0340(0x0010) ZeroConstructor, InstancedReference, BlueprintCallable, NativeAccessSpecifierPrivate
		class FScriptMulticastDelegate                             _popupBackActionDelegate;                                // 0x0350(0x0010) ZeroConstructor, InstancedReference, BlueprintCallable, NativeAccessSpecifierPrivate

	public:
		void Show(class UGenericPopupViewData* Data);
		void OnRegressionAction();
		void OnProgressionAction();
		void OnAlternativeAction();
		void Hide();
		static UClass* StaticClass();
	};

	/**
	 * Class DBDUIViewsCore.CoreHookCountWidget
	 * Size -> 0x0008 (FullSize[0x0330] - InheritedSize[0x0328])
	 */
	class UCoreHookCountWidget : public UCoreBaseHudWidget
	{
	public:
		unsigned char                                              UnknownData_O1PO[0x8];                                   // 0x0328(0x0008) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDUIViewsCore.CoreHudAlertWidget
	 * Size -> 0x0090 (FullSize[0x03B8] - InheritedSize[0x0328])
	 */
	class UCoreHudAlertWidget : public UCoreBaseHudWidget
	{
	public:
		unsigned char                                              UnknownData_DFZ6[0x8];                                   // 0x0328(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		int32_t                                                    MaxDisplayedItems;                                       // 0x0330(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		float                                                      SecondaryAlpha;                                          // 0x0334(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		float                                                      FullAlertDuration;                                       // 0x0338(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		float                                                      PendingAlertDuration;                                    // 0x033C(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		float                                                      AnimationDuration;                                       // 0x0340(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		EEasingType                                                AnimationEasing;                                         // 0x0344(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_X0TW[0x3];                                   // 0x0345(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      AnimationTranslationY;                                   // 0x0348(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_FBN0[0x4];                                   // 0x034C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UClass*                                              CoreHudScoreAlertItemClass;                              // 0x0350(0x0008) Edit, ZeroConstructor, NoClear, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class UClass*                                              CoreHudStatusEffectAlertItemClass;                       // 0x0358(0x0008) Edit, ZeroConstructor, NoClear, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class UGridPanel*                                          AlertContainer;                                          // 0x0360(0x0008) BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		TArray<class UCoreBaseUserWidget*>                         _alerts;                                                 // 0x0368(0x0010) BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate
		TArray<class UCoreBaseUserWidget*>                         _pendingAlerts;                                          // 0x0378(0x0010) BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate
		TArray<class UCoreHudScoreAlertItem*>                      _scoreAlertPool;                                         // 0x0388(0x0010) ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate
		TArray<class UCoreHudStatusEffectAlertItem*>               _statusEffectAlertPool;                                  // 0x0398(0x0010) ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_HNXO[0x10];                                  // 0x03A8(0x0010) MISSED OFFSET (PADDING)

	public:
		void PopAlert();
		void OnPopAlertComplete(class UUITweenInstance* tween);
		void OnClearAlertsComplete(class UUITweenInstance* tween);
		float GetRemainingTime();
		TArray<class UCoreBaseUserWidget*> GetPendingAlerts();
		TArray<class UCoreBaseUserWidget*> GetAlerts();
		void ClearAlerts();
		static UClass* StaticClass();
	};

	/**
	 * Class DBDUIViewsCore.CoreHudObjectivesWidget
	 * Size -> 0x0018 (FullSize[0x0340] - InheritedSize[0x0328])
	 */
	class UCoreHudObjectivesWidget : public UCoreBaseHudWidget
	{
	public:
		unsigned char                                              UnknownData_D8FC[0x10];                                  // 0x0328(0x0010) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UDBDTextBlock*                                       SpecialSpacer;                                           // 0x0338(0x0008) BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class DBDUIViewsCore.CoreHudScoreAlertItem
	 * Size -> 0x0000 (FullSize[0x0310] - InheritedSize[0x0310])
	 */
	class UCoreHudScoreAlertItem : public UCoreBaseUserWidget
	{
	public:
		void SetData(const struct FScoreAlertViewData& Data);
		static UClass* StaticClass();
	};

	/**
	 * Class DBDUIViewsCore.CoreHudStatusEffectAlertItem
	 * Size -> 0x0000 (FullSize[0x0310] - InheritedSize[0x0310])
	 */
	class UCoreHudStatusEffectAlertItem : public UCoreBaseUserWidget
	{
	public:
		void SetData(const struct FStatusEffectAlertViewData& Data);
		static UClass* StaticClass();
	};

	/**
	 * Class DBDUIViewsCore.CoreInputPromptTextWidget
	 * Size -> 0x0048 (FullSize[0x0358] - InheritedSize[0x0310])
	 */
	class UCoreInputPromptTextWidget : public UCoreBaseUserWidget
	{
	public:
		class UCoreInputPromptWidget*                              InputPrompt;                                             // 0x0310(0x0008) BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class UTextBlock*                                          TextField;                                               // 0x0318(0x0008) BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		struct FKey                                                InputKey;                                                // 0x0320(0x0020) Edit, BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class FText                                                Text;                                                    // 0x0340(0x0018) Edit, BlueprintVisible, NativeAccessSpecifierPrivate

	public:
		void SetText(const class FText& Text);
		void SetInputKey(const struct FKey& InputKey);
		static UClass* StaticClass();
	};

	/**
	 * Class DBDUIViewsCore.CoreInputPromptWidget
	 * Size -> 0x0040 (FullSize[0x0350] - InheritedSize[0x0310])
	 */
	class UCoreInputPromptWidget : public UCoreBaseUserWidget
	{
	public:
		class FText                                                _unfoundInputKeyText;                                    // 0x0310(0x0018) Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected
		struct FKey                                                _inputKey;                                               // 0x0328(0x0020) Edit, BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		bool                                                       _isEnabled;                                              // 0x0348(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_UA7X[0x7];                                   // 0x0349(0x0007) MISSED OFFSET (PADDING)

	public:
		void SetInputKey(const struct FKey& InputKey);
		void SetEnabled(bool IsEnabled);
		void PromptNotFound();
		void OnEnabledChanged(bool IsEnabled);
		bool IsEnabled();
		class FText GetInputShortDisplayName();
		struct FKey GetInputKey();
		void DisplayPrompt();
		static UClass* StaticClass();
	};

	/**
	 * Class DBDUIViewsCore.CoreInputSwitcherWidget
	 * Size -> 0x0038 (FullSize[0x0348] - InheritedSize[0x0310])
	 */
	class UCoreInputSwitcherWidget : public UCoreBaseUserWidget
	{
	public:
		EInputSwitcherDisplayRule                                  ButtonDisplayRule;                                       // 0x0310(0x0001) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EInputSwitcherDisplayRule                                  InputPromptDisplayRule;                                  // 0x0311(0x0001) Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		ETextJustify                                               Alignment;                                               // 0x0312(0x0001) Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_4UHR[0x5];                                   // 0x0313(0x0005) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UCoreKeyListenerInputPromptWidget*                   InputPrompt;                                             // 0x0318(0x0008) BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class UCoreButtonWidget*                                   Button;                                                  // 0x0320(0x0008) BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		bool                                                       _shouldRegisterForInputInConstruct;                      // 0x0328(0x0001) Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_FXOJ[0x7];                                   // 0x0329(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FScriptMulticastDelegate                             _onInputSwitcherTriggeredDelegate;                       // 0x0330(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_EGZ9[0x8];                                   // 0x0340(0x0008) MISSED OFFSET (PADDING)

	public:
		void SetUIAction(EUIActionType ActionType);
		void SetLabel(const class FText& label);
		void SetKeyOverride(const struct FKey& keyOverride);
		void SetEnabled(bool IsEnabled);
		void OnInputPromptTriggered();
		void OnButtonClicked(class UCoreButtonWidget* Target);
		void OnAlignmentChanged(ETextJustify newAlignment);
		class UCoreKeyListenerInputPromptWidget* GetInputPrompt();
		class UCoreButtonWidget* GetButton();
		static UClass* StaticClass();
	};

	/**
	 * Class DBDUIViewsCore.CoreInteractionProgressWidget
	 * Size -> 0x0030 (FullSize[0x0358] - InheritedSize[0x0328])
	 */
	class UCoreInteractionProgressWidget : public UCoreBaseHudWidget
	{
	public:
		unsigned char                                              UnknownData_3E2R[0x10];                                  // 0x0328(0x0010) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<class UCoreStatusEffectIcon*>                       Proficiencies;                                           // 0x0338(0x0010) BlueprintVisible, ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected
		class FScriptMulticastDelegate                             _hemorrhageAnimationIsCompleteDelegate;                  // 0x0348(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPrivate

	public:
		void SetProficiencies(TArray<struct FStatusEffectViewData> proficiencyDatas);
		static UClass* StaticClass();
	};

	/**
	 * Class DBDUIViewsCore.CoreInteractionPromptActionWidget
	 * Size -> 0x00B8 (FullSize[0x03C8] - InheritedSize[0x0310])
	 */
	class UCoreInteractionPromptActionWidget : public UCoreBaseUserWidget
	{
	public:
		class UCoreInputPromptWidget*                              InputPrompt;                                             // 0x0310(0x0008) BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class UCoreInputPromptWidget*                              InputPrompt2;                                            // 0x0318(0x0008) BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		class UCoreInputPromptWidget*                              InputPrompt3;                                            // 0x0320(0x0008) BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
