#pragma once

/**
 * Name: DBD
 * Version: 601
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Classes
	// --------------------------------------------------
	/**
	 * Class Engine.Actor
	 * Size -> 0x0200 (FullSize[0x0230] - InheritedSize[0x0030])
	 */
	class AActor : public UObject
	{
	public:
		struct FActorTickFunction                                  PrimaryActorTick;                                        // 0x0030(0x0030) Edit, DisableEditOnInstance, NativeAccessSpecifierPublic
		unsigned char                                              bNetTemporary : 1;                                       // 0x0060(0x0001) BIT_FIELD NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bNetStartup : 1;                                         // 0x0060(0x0001) BIT_FIELD NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bOnlyRelevantToOwner : 1;                                // 0x0060(0x0001) BIT_FIELD Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bAlwaysRelevant : 1;                                     // 0x0060(0x0001) BIT_FIELD Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bReplicateMovement : 1;                                  // 0x0060(0x0001) BIT_FIELD Edit, Net, DisableEditOnInstance, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              bHidden : 1;                                             // 0x0060(0x0001) BIT_FIELD Edit, BlueprintVisible, BlueprintReadOnly, Net, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              bTearOff : 1;                                            // 0x0060(0x0001) BIT_FIELD Net, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              bForceNetAddressable : 1;                                // 0x0060(0x0001) BIT_FIELD NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              bExchangedRoles : 1;                                     // 0x0061(0x0001) BIT_FIELD Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bNetLoadOnClient : 1;                                    // 0x0061(0x0001) BIT_FIELD Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bNetUseOwnerRelevancy : 1;                               // 0x0061(0x0001) BIT_FIELD Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bRelevantForNetworkReplays : 1;                          // 0x0061(0x0001) BIT_FIELD NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bRelevantForLevelBounds : 1;                             // 0x0061(0x0001) BIT_FIELD Edit, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bReplayRewindable : 1;                                   // 0x0061(0x0001) BIT_FIELD Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bAllowTickBeforeBeginPlay : 1;                           // 0x0061(0x0001) BIT_FIELD Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bAutoDestroyWhenFinished : 1;                            // 0x0061(0x0001) BIT_FIELD BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              bCanBeDamaged : 1;                                       // 0x0062(0x0001) BIT_FIELD Edit, BlueprintVisible, Net, SaveGame, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              bBlockInput : 1;                                         // 0x0062(0x0001) BIT_FIELD Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bCollideWhenPlacing : 1;                                 // 0x0062(0x0001) BIT_FIELD NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bFindCameraComponentWhenViewTarget : 1;                  // 0x0062(0x0001) BIT_FIELD Edit, BlueprintVisible, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bGenerateOverlapEventsDuringLevelStreaming : 1;          // 0x0062(0x0001) BIT_FIELD Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bIgnoresOriginShifting : 1;                              // 0x0062(0x0001) BIT_FIELD Edit, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bEnableAutoLODGeneration : 1;                            // 0x0062(0x0001) BIT_FIELD Edit, BlueprintVisible, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bIsEditorOnlyActor : 1;                                  // 0x0062(0x0001) BIT_FIELD Edit, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bActorSeamlessTraveled : 1;                              // 0x0063(0x0001) BIT_FIELD NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bReplicates : 1;                                         // 0x0063(0x0001) BIT_FIELD Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              bCanBeInCluster : 1;                                     // 0x0063(0x0001) BIT_FIELD Edit, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              bAllowReceiveTickEventOnDedicatedServer : 1;             // 0x0063(0x0001) BIT_FIELD NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_Y35M : 4;                                    // 0x0063(0x0001) BIT_FIELD (PADDING)
		unsigned char                                              UnknownData_UJOL : 3;                                    // 0x0064(0x0001) BIT_FIELD (PADDING)
		unsigned char                                              bActorEnableCollision : 1;                               // 0x0064(0x0001) BIT_FIELD NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              bActorIsBeingDestroyed : 1;                              // 0x0064(0x0001) BIT_FIELD Transient, DuplicateTransient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		EActorUpdateOverlapsMethod                                 UpdateOverlapsMethodDuringLevelStreaming;                // 0x0065(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		EActorUpdateOverlapsMethod                                 DefaultUpdateOverlapsMethodDuringLevelStreaming;         // 0x0066(0x0001) Edit, ZeroConstructor, Config, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		ENetRole                                                   RemoteRole;                                              // 0x0067(0x0001) Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		struct FRepMovement                                        ReplicatedMovement;                                      // 0x0068(0x0034) Edit, Net, DisableEditOnInstance, RepNotify, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPrivate
		float                                                      InitialLifeSpan;                                         // 0x009C(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      CustomTimeDilation;                                      // 0x00A0(0x0004) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_YK74[0x4];                                   // 0x00A4(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FRepAttachment                                      AttachmentReplication;                                   // 0x00A8(0x0040) Net, Transient, RepNotify, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPrivate
		class AActor*                                              Owner;                                                   // 0x00E8(0x0008) Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class FName                                                NetDriverName;                                           // 0x00F0(0x000C) ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		ENetRole                                                   Role;                                                    // 0x00FC(0x0001) Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		ENetDormancy                                               NetDormancy;                                             // 0x00FD(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		ESpawnActorCollisionHandlingMethod                         SpawnCollisionHandlingMethod;                            // 0x00FE(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EAutoReceiveInput                                          AutoReceiveInput;                                        // 0x00FF(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    InputPriority;                                           // 0x0100(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_PZIR[0x4];                                   // 0x0104(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UInputComponent*                                     InputComponent;                                          // 0x0108(0x0008) ExportObject, ZeroConstructor, InstancedReference, DuplicateTransient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      NetCullDistanceSquared;                                  // 0x0110(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    NetTag;                                                  // 0x0114(0x0004) ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      NetUpdateFrequency;                                      // 0x0118(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      MinNetUpdateFrequency;                                   // 0x011C(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      NetPriority;                                             // 0x0120(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_SSCI[0x4];                                   // 0x0124(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class APawn*                                               Instigator;                                              // 0x0128(0x0008) BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		TArray<class AActor*>                                      Children;                                                // 0x0130(0x0010) ZeroConstructor, Transient, NativeAccessSpecifierPublic
		class USceneComponent*                                     RootComponent;                                           // 0x0140(0x0008) BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		TArray<class AMatineeActor*>                               ControllingMatineeActors;                                // 0x0148(0x0010) ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_EOMD[0x8];                                   // 0x0158(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<class FName>                                        Layers;                                                  // 0x0160(0x0010) ZeroConstructor, NativeAccessSpecifierPublic
		TWeakObjectPtr<class UChildActorComponent>                 ParentComponent;                                         // 0x0170(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_34CY[0x8];                                   // 0x0178(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<class FName>                                        Tags;                                                    // 0x0180(0x0010) Edit, BlueprintVisible, ZeroConstructor, AdvancedDisplay, NativeAccessSpecifierPublic
		class FMulticastSparseDelegate                             OnTakeAnyDamage;                                         // 0x0190(0x0001) InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic
		class FMulticastSparseDelegate                             OnTakePointDamage;                                       // 0x0191(0x0001) InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic
		class FMulticastSparseDelegate                             OnTakeRadialDamage;                                      // 0x0192(0x0001) InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic
		class FMulticastSparseDelegate                             OnActorBeginOverlap;                                     // 0x0193(0x0001) InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic
		class FMulticastSparseDelegate                             OnActorEndOverlap;                                       // 0x0194(0x0001) InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic
		class FMulticastSparseDelegate                             OnBeginCursorOver;                                       // 0x0195(0x0001) InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic
		class FMulticastSparseDelegate                             OnEndCursorOver;                                         // 0x0196(0x0001) InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic
		class FMulticastSparseDelegate                             OnClicked;                                               // 0x0197(0x0001) InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic
		class FMulticastSparseDelegate                             OnReleased;                                              // 0x0198(0x0001) InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic
		class FMulticastSparseDelegate                             OnInputTouchBegin;                                       // 0x0199(0x0001) InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic
		class FMulticastSparseDelegate                             OnInputTouchEnd;                                         // 0x019A(0x0001) InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic
		class FMulticastSparseDelegate                             OnInputTouchEnter;                                       // 0x019B(0x0001) InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic
		class FMulticastSparseDelegate                             OnInputTouchLeave;                                       // 0x019C(0x0001) InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic
		class FMulticastSparseDelegate                             OnActorHit;                                              // 0x019D(0x0001) InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic
		class FMulticastSparseDelegate                             OnDestroyed;                                             // 0x019E(0x0001) InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic
		class FMulticastSparseDelegate                             OnEndPlay;                                               // 0x019F(0x0001) InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_QS7E[0x60];                                  // 0x01A0(0x0060) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<class UActorComponent*>                             InstanceComponents;                                      // 0x0200(0x0010) ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate
		TArray<class UActorComponent*>                             BlueprintCreatedComponents;                              // 0x0210(0x0010) ExportObject, ZeroConstructor, NonTransactional, ContainsInstancedReference, TextExportTransient, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_89GJ[0x10];                                  // 0x0220(0x0010) MISSED OFFSET (PADDING)

	public:
		bool WasRecentlyRendered(float Tolerance);
		void UserConstructionScript();
		void TearOff();
		void SnapRootComponentTo(class AActor* InParentActor, const class FName& InSocketName);
		void SetTickGroup(ETickingGroup NewTickGroup);
		void SetTickableWhenPaused(bool bTickableWhenPaused);
		void SetReplicates(bool bInReplicates);
		void SetReplicateMovement(bool bInReplicateMovement);
		void SetOwner(class AActor* NewOwner);
		void SetNetDormancy(ENetDormancy NewDormancy);
		void SetLifeSpan(float InLifespan);
		void SetAutoDestroyWhenFinished(bool bVal);
		void SetActorTickInterval(float TickInterval);
		void SetActorTickEnabled(bool bEnabled);
		void SetActorScale3D(const struct FVector& NewScale3D);
		void SetActorRelativeScale3D(const struct FVector& NewRelativeScale);
		void SetActorHiddenInGame(bool bNewHidden);
		void SetActorEnableCollision(bool bNewActorEnableCollision);
		void RemoveTickPrerequisiteComponent(class UActorComponent* PrerequisiteComponent);
		void RemoveTickPrerequisiteActor(class AActor* PrerequisiteActor);
		void ReceiveTick(float DeltaSeconds);
		void ReceiveRadialDamage(float DamageReceived, class UDamageType* DamageType, const struct FVector& Origin, const struct FHitResult& HitInfo, class AController* InstigatedBy, class AActor* DamageCauser);
		void ReceivePointDamage(float Damage, class UDamageType* DamageType, const struct FVector& HitLocation, const struct FVector& HitNormal, class UPrimitiveComponent* HitComponent, const class FName& BoneName, const struct FVector& ShotFromDirection, class AController* InstigatedBy, class AActor* DamageCauser, const struct FHitResult& HitInfo);
		void ReceiveHit(class UPrimitiveComponent* MyComp, class AActor* Other, class UPrimitiveComponent* OtherComp, bool bSelfMoved, const struct FVector& HitLocation, const struct FVector& HitNormal, const struct FVector& NormalImpulse, const struct FHitResult& Hit);
		void ReceiveEndPlay(EEndPlayReason EndPlayReason);
		void ReceiveDestroyed();
		void ReceiveBeginPlay();
		void ReceiveAnyDamage(float Damage, class UDamageType* DamageType, class AController* InstigatedBy, class AActor* DamageCauser);
		void ReceiveActorOnReleased(const struct FKey& ButtonReleased);
		void ReceiveActorOnInputTouchLeave(ETouchIndex FingerIndex);
		void ReceiveActorOnInputTouchEnter(ETouchIndex FingerIndex);
		void ReceiveActorOnInputTouchEnd(ETouchIndex FingerIndex);
		void ReceiveActorOnInputTouchBegin(ETouchIndex FingerIndex);
		void ReceiveActorOnClicked(const struct FKey& ButtonPressed);
		void ReceiveActorEndOverlap(class AActor* OtherActor);
		void ReceiveActorEndCursorOver();
		void ReceiveActorBeginOverlap(class AActor* OtherActor);
		void ReceiveActorBeginCursorOver();
		void PrestreamTextures(float Seconds, bool bEnableStreaming, int32_t CinematicTextureGroups);
		void OnRep_ReplicateMovement();
		void OnRep_ReplicatedMovement();
		void OnRep_Owner();
		void OnRep_Instigator();
		void OnRep_AttachmentReplication();
		void MakeNoise(float Loudness, class APawn* NoiseInstigator, const struct FVector& NoiseLocation, float MaxRange, const class FName& Tag);
		class UMaterialInstanceDynamic* MakeMIDForMaterial(class UMaterialInterface* Parent);
		bool K2_TeleportTo(const struct FVector& DestLocation, const struct FRotator& DestRotation);
		bool K2_SetActorTransform(const struct FTransform& NewTransform, bool bSweep, struct FHitResult* SweepHitResult, bool bTeleport);
		bool K2_SetActorRotation(const struct FRotator& NewRotation, bool bTeleportPhysics);
		void K2_SetActorRelativeTransform(const struct FTransform& NewRelativeTransform, bool bSweep, struct FHitResult* SweepHitResult, bool bTeleport);
		void K2_SetActorRelativeRotation(const struct FRotator& NewRelativeRotation, bool bSweep, struct FHitResult* SweepHitResult, bool bTeleport);
		void K2_SetActorRelativeLocation(const struct FVector& NewRelativeLocation, bool bSweep, struct FHitResult* SweepHitResult, bool bTeleport);
		bool K2_SetActorLocationAndRotation(const struct FVector& NewLocation, const struct FRotator& NewRotation, bool bSweep, struct FHitResult* SweepHitResult, bool bTeleport);
		bool K2_SetActorLocation(const struct FVector& NewLocation, bool bSweep, struct FHitResult* SweepHitResult, bool bTeleport);
		void K2_OnReset();
		void K2_OnEndViewTarget(class APlayerController* PC);
		void K2_OnBecomeViewTarget(class APlayerController* PC);
		class USceneComponent* K2_GetRootComponent();
		TArray<class UActorComponent*> K2_GetComponentsByClass(class UClass* ComponentClass);
		struct FRotator K2_GetActorRotation();
		struct FVector K2_GetActorLocation();
		void K2_DetachFromActor(EDetachmentRule LocationRule, EDetachmentRule RotationRule, EDetachmentRule ScaleRule);
		void K2_DestroyComponent(class UActorComponent* Component);
		void K2_DestroyActor();
		void K2_AttachToComponent(class USceneComponent* Parent, const class FName& SocketName, EAttachmentRule LocationRule, EAttachmentRule RotationRule, EAttachmentRule ScaleRule, bool bWeldSimulatedBodies);
		void K2_AttachToActor(class AActor* ParentActor, const class FName& SocketName, EAttachmentRule LocationRule, EAttachmentRule RotationRule, EAttachmentRule ScaleRule, bool bWeldSimulatedBodies);
		void K2_AttachRootComponentToActor(class AActor* InParentActor, const class FName& InSocketName, EAttachLocation AttachLocationType, bool bWeldSimulatedBodies);
		void K2_AttachRootComponentTo(class USceneComponent* InParent, const class FName& InSocketName, EAttachLocation AttachLocationType, bool bWeldSimulatedBodies);
		void K2_AddActorWorldTransformKeepScale(const struct FTransform& DeltaTransform, bool bSweep, struct FHitResult* SweepHitResult, bool bTeleport);
		void K2_AddActorWorldTransform(const struct FTransform& DeltaTransform, bool bSweep, struct FHitResult* SweepHitResult, bool bTeleport);
		void K2_AddActorWorldRotation(const struct FRotator& DeltaRotation, bool bSweep, struct FHitResult* SweepHitResult, bool bTeleport);
		void K2_AddActorWorldOffset(const struct FVector& DeltaLocation, bool bSweep, struct FHitResult* SweepHitResult, bool bTeleport);
		void K2_AddActorLocalTransform(const struct FTransform& NewTransform, bool bSweep, struct FHitResult* SweepHitResult, bool bTeleport);
		void K2_AddActorLocalRotation(const struct FRotator& DeltaRotation, bool bSweep, struct FHitResult* SweepHitResult, bool bTeleport);
		void K2_AddActorLocalOffset(const struct FVector& DeltaLocation, bool bSweep, struct FHitResult* SweepHitResult, bool bTeleport);
		bool IsOverlappingActor(class AActor* Other);
		bool IsChildActor();
		bool IsActorTickEnabled();
		bool IsActorBeingDestroyed();
		bool HasAuthority();
		float GetVerticalDistanceTo(class AActor* OtherActor);
		struct FVector GetVelocity();
		struct FTransform GetTransform();
		bool GetTickableWhenPaused();
		float GetSquaredHorizontalDistanceTo(class AActor* OtherActor);
		float GetSquaredDistanceTo(class AActor* OtherActor);
		ENetRole GetRemoteRole();
		class UChildActorComponent* GetParentComponent();
		class AActor* GetParentActor();
		class AActor* GetOwner();
		void GetOverlappingComponents(TArray<class UPrimitiveComponent*>* OverlappingComponents);
		void GetOverlappingActors(TArray<class AActor*>* OverlappingActors, class UClass* ClassFilter);
		ENetRole GetLocalRole();
		float GetLifeSpan();
		class AController* GetInstigatorController();
		class APawn* GetInstigator();
		struct FVector GetInputVectorAxisValue(const struct FKey& InputAxisKey);
		float GetInputAxisValue(const class FName& InputAxisName);
		float GetInputAxisKeyValue(const struct FKey& InputAxisKey);
		float GetHorizontalDotProductTo(class AActor* OtherActor);
		float GetHorizontalDistanceTo(class AActor* OtherActor);
		float GetGameTimeSinceCreation();
		float GetDotProductTo(class AActor* OtherActor);
		float GetDistanceTo(class AActor* OtherActor);
		TArray<class UActorComponent*> GetComponentsByTag(class UClass* ComponentClass, const class FName& Tag);
		TArray<class UActorComponent*> GetComponentsByInterface(class UClass* Interface);
		class UActorComponent* GetComponentByClass(class UClass* ComponentClass);
		class FName GetAttachParentSocketName();
		class AActor* GetAttachParentActor();
		void GetAttachedActors(TArray<class AActor*>* OutActors, bool bResetArray);
		void GetAllChildActors(TArray<class AActor*>* ChildActors, bool bIncludeDescendants);
		struct FVector GetActorUpVector();
		float GetActorTimeDilation();
		float GetActorTickInterval();
		struct FVector GetActorScale3D();
		struct FVector GetActorRightVector();
		struct FVector GetActorRelativeScale3D();
		struct FVector GetActorForwardVector();
		void GetActorEyesViewPoint(struct FVector* OutLocation, struct FRotator* OutRotation);
		bool GetActorEnableCollision();
		void GetActorBounds(bool bOnlyCollidingComponents, struct FVector* Origin, struct FVector* BoxExtent, bool bIncludeFromChildActors);
		void ForceNetUpdate();
		void FlushNetDormancy();
		void FinishAddComponent(class UActorComponent* Component, bool bManualAttachment, const struct FTransform& RelativeTransform);
		void EnableInput(class APlayerController* PlayerController);
		void DisableInput(class APlayerController* PlayerController);
		void DetachRootComponentFromParent(bool bMaintainWorldPosition);
		void AddTickPrerequisiteComponent(class UActorComponent* PrerequisiteComponent);
		void AddTickPrerequisiteActor(class AActor* PrerequisiteActor);
		class UActorComponent* AddComponentByClass(class UClass* Class, bool bManualAttachment, const struct FTransform& RelativeTransform, bool bDeferredFinish);
		class UActorComponent* AddComponent(const class FName& TemplateName, bool bManualAttachment, const struct FTransform& RelativeTransform, class UObject* ComponentTemplateContext, bool bDeferredFinish);
		bool ActorHasTag(const class FName& Tag);
		static UClass* StaticClass();
	};

	/**
	 * Class Engine.GameInstance
	 * Size -> 0x01D0 (FullSize[0x0200] - InheritedSize[0x0030])
	 */
	class UGameInstance : public UObject
	{
	public:
		unsigned char                                              UnknownData_08Y8[0x10];                                  // 0x0030(0x0010) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<class ULocalPlayer*>                                LocalPlayers;                                            // 0x0040(0x0010) ZeroConstructor, Protected, NativeAccessSpecifierProtected
		class UOnlineSession*                                      OnlineSession;                                           // 0x0050(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		TArray<class UObject*>                                     ReferencedObjects;                                       // 0x0058(0x0010) ZeroConstructor, Protected, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_GBKN[0x18];                                  // 0x0068(0x0018) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FScriptMulticastDelegate                             OnPawnControllerChangedDelegates;                        // 0x0080(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_0KY2[0x170];                                 // 0x0090(0x0170) MISSED OFFSET (PADDING)

	public:
		void ToggleDisableComponent(const class FString& comp);
		void ReceiveShutdown();
		void ReceiveInit();
		void HandleTravelError(ETravelFailure FailureType);
		void HandleNetworkError(ENetworkFailure FailureType, bool bIsServer);
		void DumpDisabledComponents();
		void DebugRemovePlayer(int32_t ControllerId);
		void DebugCreatePlayer(int32_t ControllerId);
		static UClass* StaticClass();
	};

	/**
	 * Class Engine.Info
	 * Size -> 0x0000 (FullSize[0x0230] - InheritedSize[0x0230])
	 */
	class AInfo : public AActor
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Engine.BlueprintFunctionLibrary
	 * Size -> 0x0000 (FullSize[0x0030] - InheritedSize[0x0030])
	 */
	class UBlueprintFunctionLibrary : public UObject
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Engine.BlueprintAsyncActionBase
	 * Size -> 0x0008 (FullSize[0x0038] - InheritedSize[0x0030])
	 */
	class UBlueprintAsyncActionBase : public UObject
	{
	public:
		unsigned char                                              UnknownData_HCU0[0x8];                                   // 0x0030(0x0008) MISSED OFFSET (PADDING)

	public:
		void Activate();
		static UClass* StaticClass();
	};

	/**
	 * Class Engine.OnlineBlueprintCallProxyBase
	 * Size -> 0x0000 (FullSize[0x0038] - InheritedSize[0x0038])
	 */
	class UOnlineBlueprintCallProxyBase : public UBlueprintAsyncActionBase
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Engine.Player
	 * Size -> 0x0020 (FullSize[0x0050] - InheritedSize[0x0030])
	 */
	class UPlayer : public UObject
	{
	public:
		unsigned char                                              UnknownData_B4KZ[0x8];                                   // 0x0030(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class APlayerController*                                   PlayerController;                                        // 0x0038(0x0008) ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    CurrentNetSpeed;                                         // 0x0040(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    ConfiguredInternetSpeed;                                 // 0x0044(0x0004) ZeroConstructor, Config, GlobalConfig, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    ConfiguredLanSpeed;                                      // 0x0048(0x0004) ZeroConstructor, Config, GlobalConfig, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_DUFT[0x4];                                   // 0x004C(0x0004) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Engine.NetConnection
	 * Size -> 0x1B78 (FullSize[0x1BC8] - InheritedSize[0x0050])
	 */
	class UNetConnection : public UPlayer
	{
	public:
		TArray<class UChildConnection*>                            Children;                                                // 0x0050(0x0010) ZeroConstructor, Transient, NativeAccessSpecifierPublic
		class UNetDriver*                                          Driver;                                                  // 0x0060(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UClass*                                              PackageMapClass;                                         // 0x0068(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UPackageMap*                                         PackageMap;                                              // 0x0070(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		TArray<class UChannel*>                                    OpenChannels;                                            // 0x0078(0x0010) ZeroConstructor, NativeAccessSpecifierPublic
		TArray<class AActor*>                                      SentTemporaries;                                         // 0x0088(0x0010) ZeroConstructor, NativeAccessSpecifierPublic
		class AActor*                                              ViewTarget;                                              // 0x0098(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class AActor*                                              OwningActor;                                             // 0x00A0(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    MaxPacket;                                               // 0x00A8(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              InternalAck : 1;                                         // 0x00AC(0x0001) BIT_FIELD NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_UWTQ[0xBB];                                  // 0x00AD(0x00BB) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FUniqueNetIdRepl                                    playerID;                                                // 0x0168(0x0028) HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_X4W3[0x48];                                  // 0x0190(0x0048) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		double                                                     LastReceiveTime;                                         // 0x01D8(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_U8A3[0x1340];                                // 0x01E0(0x1340) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<class UChannel*>                                    ChannelsToTick;                                          // 0x1520(0x0010) ZeroConstructor, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_GCN7[0x698];                                 // 0x1530(0x0698) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Engine.NetDriver
	 * Size -> 0x0750 (FullSize[0x0780] - InheritedSize[0x0030])
	 */
	class UNetDriver : public UObject
	{
	public:
		unsigned char                                              UnknownData_QAZU[0x8];                                   // 0x0030(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FString                                              NetConnectionClassName;                                  // 0x0038(0x0010) ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FString                                              ReplicationDriverClassName;                              // 0x0048(0x0010) ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    MaxDownloadSize;                                         // 0x0058(0x0004) ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bClampListenServerTickRate : 1;                          // 0x005C(0x0001) BIT_FIELD Config, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_5G81[0x3];                                   // 0x005D(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		int32_t                                                    NetServerMaxTickRate;                                    // 0x0060(0x0004) ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    MaxNetTickRate;                                          // 0x0064(0x0004) ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    MaxInternetClientRate;                                   // 0x0068(0x0004) ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    MaxClientRate;                                           // 0x006C(0x0004) ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      ServerTravelPause;                                       // 0x0070(0x0004) ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      SpawnPrioritySeconds;                                    // 0x0074(0x0004) ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      RelevantTimeout;                                         // 0x0078(0x0004) ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      KeepAliveTime;                                           // 0x007C(0x0004) ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      InitialConnectTimeout;                                   // 0x0080(0x0004) ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      ConnectionTimeout;                                       // 0x0084(0x0004) ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      InitialDevConnectionTimeout;                             // 0x0088(0x0004) ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      TimeoutMultiplierForUnoptimizedBuilds;                   // 0x008C(0x0004) ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bNoTimeouts;                                             // 0x0090(0x0001) ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bNeverApplyNetworkEmulationSettings;                     // 0x0091(0x0001) ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_DW6O[0x6];                                   // 0x0092(0x0006) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UNetConnection*                                      ServerConnection;                                        // 0x0098(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		TArray<class UNetConnection*>                              ClientConnections;                                       // 0x00A0(0x0010) ZeroConstructor, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_AGM8[0x60];                                  // 0x00B0(0x0060) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		int32_t                                                    RecentlyDisconnectedTrackingTime;                        // 0x0110(0x0004) ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_5MD1[0x3C];                                  // 0x0114(0x003C) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UWorld*                                              World;                                                   // 0x0150(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UPackage*                                            WorldPackage;                                            // 0x0158(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_2R5O[0x20];                                  // 0x0160(0x0020) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UClass*                                              NetConnectionClass;                                      // 0x0180(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UClass*                                              ReplicationDriverClass;                                  // 0x0188(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_Q7RE[0x10];                                  // 0x0190(0x0010) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FName                                                NetDriverName;                                           // 0x01A0(0x000C) ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_SQCJ[0x4];                                   // 0x01AC(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<struct FChannelDefinition>                          ChannelDefinitions;                                      // 0x01B0(0x0010) ZeroConstructor, Config, NativeAccessSpecifierPublic
		TMap<class FName, struct FChannelDefinition>               ChannelDefinitionMap;                                    // 0x01C0(0x0050) NativeAccessSpecifierPublic
		TArray<class UChannel*>                                    ActorChannelPool;                                        // 0x0210(0x0010) ZeroConstructor, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_M88Y[0x8];                                   // 0x0220(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      Time;                                                    // 0x0228(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_7CLP[0x4BC];                                 // 0x022C(0x04BC) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      ExpireViewTargetDelay;                                   // 0x06E8(0x0004) ZeroConstructor, Config, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_2IIT[0x34];                                  // 0x06EC(0x0034) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UReplicationDriver*                                  ReplicationDriver;                                       // 0x0720(0x0008) ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_4AE8[0x58];                                  // 0x0728(0x0058) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Engine.OnlineEngineInterface
	 * Size -> 0x0000 (FullSize[0x0030] - InheritedSize[0x0030])
	 */
	class UOnlineEngineInterface : public UObject
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Engine.OnlineSession
	 * Size -> 0x0000 (FullSize[0x0030] - InheritedSize[0x0030])
	 */
	class UOnlineSession : public UObject
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class Engine.ActorComponent
	 * Size -> 0x0088 (FullSize[0x00B8] - InheritedSize[0x0030])
	 */
	class UActorComponent : public UObject
	{
	public:
		unsigned char                                              UnknownData_YMVE[0x8];                                   // 0x0030(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FActorComponentTickFunction                         PrimaryComponentTick;                                    // 0x0038(0x0030) Edit, DisableEditOnInstance, NativeAccessSpecifierPublic
		TArray<class FName>                                        ComponentTags;                                           // 0x0068(0x0010) Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic
		TArray<class UAssetUserData*>                              AssetUserData;                                           // 0x0078(0x0010) Edit, ExportObject, ZeroConstructor, ContainsInstancedReference, AdvancedDisplay, Protected, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_VFHR[0x4];                                   // 0x0088(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		int32_t                                                    UCSSerializationIndex;                                   // 0x008C(0x0004) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_B3IC : 3;                                    // 0x0090(0x0001) BIT_FIELD (PADDING)
		unsigned char                                              bNetAddressable : 1;                                     // 0x0090(0x0001) BIT_FIELD NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              bReplicates : 1;                                         // 0x0090(0x0001) BIT_FIELD Edit, BlueprintVisible, BlueprintReadOnly, Net, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_SCHY : 3;                                    // 0x0090(0x0001) BIT_FIELD (PADDING)
		unsigned char                                              UnknownData_4DKL : 7;                                    // 0x0091(0x0001) BIT_FIELD (PADDING)
		unsigned char                                              bAutoActivate : 1;                                       // 0x0091(0x0001) BIT_FIELD Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              bIsActive : 1;                                           // 0x0092(0x0001) BIT_FIELD Net, Transient, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              bEditableWhenInherited : 1;                              // 0x0092(0x0001) BIT_FIELD Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_79MW : 1;                                    // 0x0092(0x0001) BIT_FIELD (PADDING)
		unsigned char                                              bCanEverAffectNavigation : 1;                            // 0x0092(0x0001) BIT_FIELD Edit, Config, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_S65X : 1;                                    // 0x0092(0x0001) BIT_FIELD (PADDING)
		unsigned char                                              bIsEditorOnly : 1;                                       // 0x0092(0x0001) BIT_FIELD Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_EZZN[0x1];                                   // 0x0093(0x0001) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		EComponentCreationMethod                                   CreationMethod;                                          // 0x0094(0x0001) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FMulticastSparseDelegate                             OnComponentActivated;                                    // 0x0095(0x0001) InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic
		class FMulticastSparseDelegate                             OnComponentDeactivated;                                  // 0x0096(0x0001) InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_DAGU[0x1];                                   // 0x0097(0x0001) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<struct FSimpleMemberReference>                      UCSModifiedProperties;                                   // 0x0098(0x0010) ZeroConstructor, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_2MWN[0x10];                                  // 0x00A8(0x0010) MISSED OFFSET (PADDING)

	public:
		void ToggleActive();
		void SetTickGroup(ETickingGroup NewTickGroup);
		void SetTickableWhenPaused(bool bTickableWhenPaused);
		void SetIsReplicated(bool ShouldReplicate);
		void SetComponentTickIntervalAndCooldown(float TickInterval);
		void SetComponentTickInterval(float TickInterval);
		void SetComponentTickEnabled(bool bEnabled);
		void SetAutoActivate(bool bNewAutoActivate);
		void SetActive(bool bNewActive, bool bReset);
		void RemoveTickPrerequisiteComponent(class UActorComponent* PrerequisiteComponent);
		void RemoveTickPrerequisiteActor(class AActor* PrerequisiteActor);
		void ReceiveTick(float DeltaSeconds);
		void ReceiveEndPlay(EEndPlayReason EndPlayReason);
		void ReceiveBeginPlay();
		void OnRep_IsActive();
		void K2_DestroyComponent(class UObject* Object);
		bool IsComponentTickEnabled();
		bool IsBeingDestroyed();
		bool IsActive();
		class AActor* GetOwner();
		float GetComponentTickInterval();
		void Deactivate();
		bool ComponentHasTag(const class FName& Tag);
		void AddTickPrerequisiteComponent(class UActorComponent* PrerequisiteComponent);
		void AddTickPrerequisiteActor(class AActor* PrerequisiteActor);
		void Activate(bool bReset);
		static UClass* StaticClass();
	};

	/**
	 * Class Engine.SceneComponent
	 * Size -> 0x0168 (FullSize[0x0220] - InheritedSize[0x00B8])
	 */
	class USceneComponent : public UActorComponent
	{
	public:
		unsigned char                                              UnknownData_YZ1I[0x8];                                   // 0x00B8(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TWeakObjectPtr<class APhysicsVolume>                       PhysicsVolume;                                           // 0x00C0(0x0008) ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class USceneComponent*                                     AttachParent;                                            // 0x00C8(0x0008) ExportObject, Net, ZeroConstructor, InstancedReference, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class FName                                                AttachSocketName;                                        // 0x00D0(0x000C) Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_ZGMS[0x4];                                   // 0x00DC(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<class USceneComponent*>                             AttachChildren;                                          // 0x00E0(0x0010) ExportObject, Net, ZeroConstructor, Transient, RepNotify, ContainsInstancedReference, NativeAccessSpecifierPrivate
		TArray<class USceneComponent*>                             ClientAttachedChildren;                                  // 0x00F0(0x0010) ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_N03X[0x34];                                  // 0x0100(0x0034) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FVector                                             RelativeLocation;                                        // 0x0134(0x000C) Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		struct FRotator                                            RelativeRotation;                                        // 0x0140(0x000C) Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, NativeAccessSpecifierPrivate
		struct FVector                                             RelativeScale3D;                                         // 0x014C(0x000C) Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, RepNotify, Interp, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		struct FVector                                             ComponentVelocity;                                       // 0x0158(0x000C) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_IOEG : 1;                                    // 0x0164(0x0001) BIT_FIELD (PADDING)
		unsigned char                                              bComponentToWorldUpdated : 1;                            // 0x0164(0x0001) BIT_FIELD Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_5UG1 : 1;                                    // 0x0164(0x0001) BIT_FIELD (PADDING)
		unsigned char                                              bAbsoluteLocation : 1;                                   // 0x0164(0x0001) BIT_FIELD Edit, BlueprintVisible, Net, RepNotify, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              bAbsoluteRotation : 1;                                   // 0x0164(0x0001) BIT_FIELD Edit, BlueprintVisible, Net, RepNotify, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              bAbsoluteScale : 1;                                      // 0x0164(0x0001) BIT_FIELD Edit, BlueprintVisible, Net, RepNotify, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              bVisible : 1;                                            // 0x0164(0x0001) BIT_FIELD Edit, BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              bShouldBeAttached : 1;                                   // 0x0164(0x0001) BIT_FIELD Net, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              bShouldSnapLocationWhenAttached : 1;                     // 0x0165(0x0001) BIT_FIELD Net, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
